
#Область СлужебныеПроцедурыИФункции

Процедура Прейскурант(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.ПрейскурантЦен.ПолучитьМакет("Прейскурант");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрейскурантЦен.Дата КАК Дата,
		|	ПрейскурантЦен.Номер КАК Номер,
		|	ПрейскурантЦен.Цены.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		НоваяЦена КАК НоваяЦена,
		|		НДС КАК НДС,
		|		НоваяЦенаСНДС КАК НоваяЦенаСНДС
		|	) КАК Цены,
		|	ПрейскурантЦен.ДатаУтверждения КАК ДатаУтверждения,
		|	Константы.НаименованиеОрганизации КАК НаименованиеОрганизации,
		|	Константы.Руководитель.ФамилияИнициалы КАК РуководительФамилияИнициалы
		|ИЗ
		|	Документ.ПрейскурантЦен КАК ПрейскурантЦен,
		|	Константы КАК Константы
		|ГДЕ
		|	ПрейскурантЦен.Ссылка В(&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьЦеныШапка = Макет.ПолучитьОбласть("ЦеныШапка");
		ОбластьЦены = Макет.ПолучитьОбласть("Цены");
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ОбластьЗаголовок.Параметры.РуководительФамилияИнициалы = Выборка.РуководительФамилияИнициалы;
			ОбластьЗаголовок.Параметры.Организация = Выборка.НаименованиеОрганизации;
			ОбластьЗаголовок.Параметры.ДатаУтверждения = Формат(Выборка.ДатаУтверждения, "ДЛФ=ДД");
			ТабДок.Вывести(ОбластьЗаголовок);
			
			
			Шапка.Параметры.Заполнить(Выборка);
			Шапка.Параметры.Организация = Выборка.НаименованиеОрганизации;
			Шапка.Параметры.ДатаДокумента = Формат(Выборка.Дата, "ДЛФ=Д");
			
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьЦеныШапка);
			ВыборкаЦены = Выборка.Цены.Выбрать();
			Пока ВыборкаЦены.Следующий() Цикл
				ОбластьЦены.Параметры.Заполнить(ВыборкаЦены);
				ОбластьЦены.Параметры.ЕдиницыИзмерения = ВыборкаЦены.Номенклатура.ЕдиницыИзмерения.Наименование;
				ТабДок.Вывести(ОбластьЦены, ВыборкаЦены.Уровень());
			КонецЦикла;
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

Процедура ПрейскурантСКартинкой(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.ПрейскурантЦен.ПолучитьМакет("ПрейскурантСКартинкой");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрейскурантЦен.Дата КАК Дата,
		|	ПрейскурантЦен.Номер КАК Номер,
		|	ПрейскурантЦен.Цены.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		НоваяЦена КАК НоваяЦена,
		|		НДС КАК НДС,
		|		НоваяЦенаСНДС КАК НоваяЦенаСНДС,
		|		Номенклатура.Картинка КАК НоменклатураКартинка
		|	) КАК Цены,
		|	ПрейскурантЦен.ДатаУтверждения КАК ДатаУтверждения,
		|	Константы.НаименованиеОрганизации КАК НаименованиеОрганизации,
		|	Константы.Руководитель.ФамилияИнициалы КАК РуководительФамилияИнициалы
		|ИЗ
		|	Документ.ПрейскурантЦен КАК ПрейскурантЦен,
		|	Константы КАК Константы
		|ГДЕ
		|	ПрейскурантЦен.Ссылка В(&Ссылка)
		|	И ПрейскурантЦен.Цены.НеВключатьВПрайс = ЛОЖЬ";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьЦеныШапка = Макет.ПолучитьОбласть("ЦеныШапка");
		ОбластьЦены = Макет.ПолучитьОбласть("Цены");
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ОбластьЗаголовок.Параметры.РуководительФамилияИнициалы = Выборка.РуководительФамилияИнициалы;
			ОбластьЗаголовок.Параметры.Организация = Выборка.НаименованиеОрганизации;
			ОбластьЗаголовок.Параметры.ДатаУтверждения = Формат(Выборка.ДатаУтверждения, "ДЛФ=ДД");
			ТабДок.Вывести(ОбластьЗаголовок);
			
			
			Шапка.Параметры.Заполнить(Выборка);
			Шапка.Параметры.Организация = Выборка.НаименованиеОрганизации;
			Шапка.Параметры.ДатаДокумента = Формат(Выборка.Дата, "ДЛФ=Д");
			
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьЦеныШапка);
			ВыборкаЦены = Выборка.Цены.Выбрать();
			Пока ВыборкаЦены.Следующий() Цикл
				ОбластьЦены.Параметры.Заполнить(ВыборкаЦены);
				
				Если Не ТипЗнч(ВыборкаЦены.НоменклатураКартинка.Получить()) = Тип("Неопределено") Тогда
					
					КартинкаИзХранилища = Новый Картинка(ВыборкаЦены.НоменклатураКартинка.Получить());
					
					КартинкаНаМакете = ОбластьЦены.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
					ОбластьЦены.Рисунки.КартинкаНоменклатуры.Картинка = КартинкаИзХранилища;
				КонецЕсли; 
				
				ОбластьЦены.Параметры.ЕдиницыИзмерения = ВыборкаЦены.Номенклатура.ЕдиницыИзмерения.Наименование;
				ТабДок.Вывести(ОбластьЦены, ВыборкаЦены.Уровень());
				ОбластьЦены.Рисунки.КартинкаНоменклатуры.Картинка = Новый Картинка();
			КонецЦикла;
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
		
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

#КонецОбласти
