#Область ОбработчикиСобытий
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент;
	СлужебнаяЗаписка(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура СлужебнаяЗаписка(ТабДок, ПараметрКоманды)
	Документы.СписаниеВспомогательныхСредств.СлужебнаяЗаписка(ТабДок, ПараметрКоманды);
КонецПроцедуры

#КонецОбласти

