#Область ПрограммныйИнтерфейс

// Возвращает остаток номенклатур на складе на дату
//
// Параметры:
//  ОстДата	- Дата - Дата на которую возвращаются остатки
//  ОстСклад - СправочникСсылка.Склад
//	ОстНоменклатура - СправочникСсылка.Номенклатура
//
// Возвращаемое значение:
//   Число   - Количественный остаток 
//
Функция ОстаткиНоменклатуры(ОстДата, ОстСклад, ОстНоменклатура) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ТовОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.Остатки.Остатки(&ОстДата)
	|КАК 
	|	ТовОстатки
	|ГДЕ
	|	ТовОстатки.Склад = &ОстСклад И
	|	ТовОстатки.Номенклатура = &ОстНоменклатура";
	
	Запрос.УстановитьПараметр("ОстДата", ОстДата);
	Запрос.УстановитьПараметр("ОстСклад", ОстСклад);
	Запрос.УстановитьПараметр("ОстНоменклатура", ОстНоменклатура);
	
	Записи = Запрос.Выполнить().Выбрать();
	Пока Записи.Следующий() Цикл 
		Возврат (Записи.КоличествоОстаток);
	КонецЦикла;
	Возврат 0;
КонецФункции

#КонецОбласти
