
#Область СлужебныеПроцедурыИФункции

Процедура СлужебнаяЗаписка(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.СписаниеВспомогательныхСредств.ПолучитьМакет("СлужебнаяЗаписка");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СписаниеВспомогательныхСредств.Автор,
		|	СписаниеВспомогательныхСредств.Дата,
		|	СписаниеВспомогательныхСредств.Номер,
		|	СписаниеВспомогательныхСредств.Номенклатура.(
		|		НомерСтроки,
		|		Материал,
		|		КодПоБухгалтерии,
		|		КоличествоСписания,
		|		ПричинаСписания
		|	)
		|ИЗ
		|	Документ.СписаниеВспомогательныхСредств КАК СписаниеВспомогательныхСредств
		|ГДЕ
		|	СписаниеВспомогательныхСредств.Ссылка В (&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьНоменклатураШапка = Макет.ПолучитьОбласть("НоменклатураШапка");
		ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			Шапка.Параметры.НаименованиеОрганизации = ОбщегоНазначенияСервер.ПолучитьНаименованиеОрганизации();
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьНоменклатураШапка);
			ВыборкаНоменклатура = Выборка.Номенклатура.Выбрать();
			Нумератор = 1;
			Пока ВыборкаНоменклатура.Следующий() Цикл
				Если ВыборкаНоменклатура.КоличествоСписания <> 0 Тогда
					ОбластьНоменклатура.Параметры.Заполнить(ВыборкаНоменклатура);
					ОбластьНоменклатура.Параметры.НомерСтрокиН =Нумератор;
					Нумератор = Нумератор + 1;
					ТабДок.Вывести(ОбластьНоменклатура, ВыборкаНоменклатура.Уровень());
				КонецЕсли;
			КонецЦикла;
			
			Подвал.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал);
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

Процедура Контроль(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.СписаниеВспомогательныхСредств.ПолучитьМакет("Контроль");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(СписаниеВспомогательныхСредствНоменклатура.КоличествоСписания) КАК КоличествоСписания,
		|	СписаниеВспомогательныхСредствНоменклатура.Категория КАК Категория
		|ПОМЕСТИТЬ РасходМатериалов
		|ИЗ
		|	Документ.СписаниеВспомогательныхСредств.Номенклатура КАК СписаниеВспомогательныхСредствНоменклатура
		|ГДЕ
		|	СписаниеВспомогательныхСредствНоменклатура.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СписаниеВспомогательныхСредствНоменклатура.Категория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НормыРасходВспомогательныхСредствСрезПоследних.Склад КАК Склад,
		|	НормыРасходВспомогательныхСредствСрезПоследних.КатегорияМатериалов КАК КатегорияМатериалов,
		|	НормыРасходВспомогательныхСредствСрезПоследних.Количество КАК Количество,
		|	РасходМатериалов.КоличествоСписания КАК КоличествоСписания
		|ИЗ
		|	РасходМатериалов КАК РасходМатериалов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормыРасходВспомогательныхСредств.СрезПоследних(&ДатаДокумента, ) КАК НормыРасходВспомогательныхСредствСрезПоследних
		|		ПО РасходМатериалов.Категория = НормыРасходВспомогательныхСредствСрезПоследних.КатегорияМатериалов
		|ГДЕ
		|	НормыРасходВспомогательныхСредствСрезПоследних.Склад = &Склад";
		Запрос.Параметры.Вставить("Ссылка", Ссылка[0]);
		Запрос.Параметры.Вставить("ДатаДокумента", Ссылка[0].Дата);
		Запрос.Параметры.Вставить("Склад", Ссылка[0].Автор.СкладСырья);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьНоменклатураШапка = Макет.ПолучитьОбласть("НоменклатураШапка");
		ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
		
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		ТабДок.Вывести(ОбластьЗаголовок);
		ТабДок.Вывести(ОбластьНоменклатураШапка);
		
		Пока Выборка.Следующий() Цикл
			ОбластьНоменклатура.Параметры.Заполнить(Выборка);
			ОбластьНоменклатура.Параметры.Контроль = ?(Выборка.КоличествоСписания > Выборка.Количество, "Перерасход", "ОК");
			ТабДок.Вывести(ОбластьНоменклатура);
		КонецЦикла;
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

#КонецОбласти
