
#Область СлужебныеПроцедурыИФункции

Процедура АктОтбораПроб1(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.Списание.ПолучитьМакет("АктОтбораПроб1");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Списание.Дата КАК Дата,
		|	Списание.Номер КАК Номер,
		|	Списание.ОбъектПроизводства КАК ОбъектПроизводства,
		|	Списание.ОтбиравшийПробу КАК ОтбиравшийПробу,
		|	Списание.Представитель КАК Представитель,
		|	Списание.ПричиныОтбораПроб КАК ПричиныОтбораПроб,
		|	Списание.ТНПА КАК ТНПА,
		|	Списание.Пробы.(
		|		НомерСтроки КАК НомерСтроки,
		|		НаименованиеПроб КАК НаименованиеПроб,
		|		ДатаИзготовления КАК ДатаИзготовления,
		|		ВЫБОР
		|			КОГДА Списание.Пробы.ДатаРозлива = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА """"
		|			ИНАЧЕ Списание.Пробы.ДатаРозлива
		|		КОНЕЦ КАК ДатаРозлива,
		|		ВеличинаПартии КАК ВеличинаПартии,
		|		НомерПартии КАК НомерПартии,
		|		ВесПробы КАК ВесПробы,
		|		ЦельИсследования КАК ЦельИсследования,
		|		НаименованиеПроб.ЕдиницыИзмерения.Наименование КАК НаименованиеПробЕдиницыИзмеренияНаименование
		|	) КАК Пробы,
		|	Списание.МаслоТехническое КАК МаслоТехническое,
		|	Списание.ОтбиравшийПробу.ФамилияИнициалы КАК ОтбиравшийПробуФамилияИнициалы,
		|	Списание.Представитель.ФамилияИнициалы КАК ПредставительФамилияИнициалы
		|ИЗ
		|	Документ.Списание КАК Списание
		|ГДЕ
		|	Списание.Ссылка В(&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьПробыШапка = Макет.ПолучитьОбласть("ПробыШапка");
		ОбластьПробы = Макет.ПолучитьОбласть("Пробы");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьМаслоТехническое = Макет.ПолучитьОбласть("МаслоТехническое");
		
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьПробыШапка);
			ВыборкаПробы = Выборка.Пробы.Выбрать();
			Пока ВыборкаПробы.Следующий() Цикл
				ОбластьПробы.Параметры.Заполнить(ВыборкаПробы);
				ОбластьПробы.Параметры.ДатаИзготовления = Формат(ВыборкаПробы.ДатаИзготовления, "ДЛФ=ДД");
				ОбластьПробы.Параметры.ДатаРозлива = Формат(ВыборкаПробы.ДатаРозлива, "ДЛФ=ДД");
				
				ТабДок.Вывести(ОбластьПробы, ВыборкаПробы.Уровень());
			КонецЦикла;
			Если Выборка.МаслоТехническое > 0 Тогда
				ОбластьМаслоТехническое.Параметры.Заполнить(Выборка);
				ТабДок.Вывести(ОбластьМаслоТехническое);
			КонецЕсли; 
			
			Подвал.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал);
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

Процедура АктОтбораПроб2(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.Списание.ПолучитьМакет("АктОтбораПроб2");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Списание.Дата,
		|	Списание.Номер,
		|	Списание.ОбъектПроизводства,
		|	Списание.ОтбиравшийПробу,
		|	Списание.Представитель,
		|	Списание.ПричиныОтбораПроб,
		|	Списание.ТНПА,
		|	Списание.Пробы.(
		|		НомерСтроки,
		|		НаименованиеПроб,
		|		ЕдиницыИзмерения,
		|		НомерПартии,
		|		ВеличинаПартии,
		|		ДатаИзготовления,
		|		ВесПробы
		|	)
		|ИЗ
		|	Документ.Списание КАК Списание
		|ГДЕ
		|	Списание.Ссылка В (&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьПробыШапка = Макет.ПолучитьОбласть("ПробыШапка");
		ОбластьПробы = Макет.ПолучитьОбласть("Пробы");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьПробыШапка);
			ВыборкаПробы = Выборка.Пробы.Выбрать();
			Пока ВыборкаПробы.Следующий() Цикл
				ОбластьПробы.Параметры.Заполнить(ВыборкаПробы);
				ТабДок.Вывести(ОбластьПробы, ВыборкаПробы.Уровень());
			КонецЦикла;
			
			Подвал.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал);
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

Процедура АктОтбораПроб3(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.Списание.ПолучитьМакет("АктОтбораПроб3");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Списание.Дата КАК Дата,
		|	Списание.Номер КАК Номер,
		|	Списание.ОбъектПроизводства КАК ОбъектПроизводства,
		|	Списание.ОтбиравшийПробу КАК ОтбиравшийПробу,
		|	Списание.Представитель КАК Представитель,
		|	Списание.ПричиныОтбораПроб КАК ПричиныОтбораПроб,
		|	Списание.Пробы.(
		|		НомерСтроки КАК НомерСтроки,
		|		НаименованиеПроб КАК НаименованиеПроб,
		|		ДатаИзготовления КАК ДатаИзготовления,
		|		ВеличинаПартии КАК ВеличинаПартии,
		|		ВесПробы КАК ВесПробы,
		|		ЦельИсследования КАК ЦельИсследования,
		|		ТНПА1 КАК ТНПА1,
		|		ТНПАНаОтборПроб КАК ТНПА2,
		|		НомерПартии КАК НомерПартии,
		|		НаименованиеПроб.МассаНетто КАК НаименованиеПробМассаНетто
		|	) КАК Пробы,
		|	Списание.ОбъектПроизводства.Адрес КАК ОбъектПроизводстваАдрес,
		|	Списание.УсловияТранспортировки КАК УсловияТранспортировки,
		|	Списание.ИнформацияОбИдентификации КАК ИнформацияОбИдентификации
		|ИЗ
		|	Документ.Списание КАК Списание
		|ГДЕ
		|	Списание.Ссылка В(&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьПробыШапка = Макет.ПолучитьОбласть("ПробыШапка");
		ОбластьПробы = Макет.ПолучитьОбласть("Пробы");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьПробыШапка);
			ВыборкаПробы = Выборка.Пробы.Выбрать();
			Пока ВыборкаПробы.Следующий() Цикл
				ОбластьПробы.Параметры.Заполнить(ВыборкаПробы);
				ОбластьПробы.Параметры.НаименованиеОрганизации = ОбщегоНазначенияСервер.ПолучитьНаименованиеОрганизации();
				ТабДок.Вывести(ОбластьПробы, ВыборкаПробы.Уровень());
			КонецЦикла;
			
			Подвал.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал);
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

Процедура СлужебнаяЗаписка(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(СлужебнаяЗаписка)
	Макет = Документы.Списание.ПолучитьМакет("СлужебнаяЗаписка");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Списание.Автор КАК Автор,
	|	Списание.Дата КАК Дата,
	|	Списание.Пробы.(
	|		НомерСтроки КАК НомерСтроки,
	|		НаименованиеПроб КАК НаименованиеПроб,
	|		ЕдиницыИзмерения КАК ЕдиницыИзмерения,
	|		ВесПробы КАК ВесПробы
	|	) КАК Пробы,
	|	НаименованиеОрганизации.Значение КАК ЗначениеНаименованияОрганизации,
	|	Списание.ОбъектПроизводства.Наименование КАК ОбъектПроизводстваНаименование,
	|	Руководитель.Значение.ФамилияИнициалыДательный КАК ЗначениеФамилияИнициалыДательный,
	|	Списание.ТекстДляСлужебной КАК ТекстДляСлужебной,
	|	Списание.Автор.Должность.Наименование КАК АвторДолжностьНаименование,
	|	Списание.Автор.ФамилияИнициалы КАК АвторФамилияИнициалы
	|ИЗ
	|	Документ.Списание КАК Списание,
	|	Константа.Руководитель КАК Руководитель,
	|	Константа.НаименованиеОрганизации КАК НаименованиеОрганизации
	|ГДЕ
	|	Списание.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПробыШапка = Макет.ПолучитьОбласть("ПробыШапка");
	ОбластьПробы = Макет.ПолучитьОбласть("Пробы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПробыШапка);
		ВыборкаПробы = Выборка.Пробы.Выбрать();
		Пока ВыборкаПробы.Следующий() Цикл
			ОбластьПробы.Параметры.Заполнить(ВыборкаПробы);
			ТабДок.Вывести(ОбластьПробы, ВыборкаПробы.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

#КонецОбласти
