
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура ОбработкаПроведения(Отказ, Режим)
		// регистр Скидки
		Движения.Скидки.Записывать = Истина;
		Для Каждого ТекСтрокаСкидки Из Скидки Цикл
			Движение = Движения.Скидки.Добавить();
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Номенклатура = ТекСтрокаСкидки.Номенклатура;
			Движение.Скидка = ТекСтрокаСкидки.НоваяСкидка;
		КонецЦикла;
	КонецПроцедуры
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
