
Процедура ПротоколИспытаний(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПротоколИспытаний)
	Макет = Документы.ПротоколИспытаний.ПолучитьМакет("ПротоколИспытаний");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПротоколИспытаний.АктОтбораПроб КАК АктОтбораПроб,
	|	ПротоколИспытаний.ВидКонтроля КАК ВидКонтроля,
	|	ПротоколИспытаний.ВидУпаковки КАК ВидУпаковки,
	|	ПротоколИспытаний.Вывод КАК Вывод,
	|	ПротоколИспытаний.Дата КАК Дата,
	|	ПротоколИспытаний.ДатаПроведенияИспытаний КАК ДатаПроведенияИспытаний,
	|	ПротоколИспытаний.ДокументОтбораПроб КАК ДокументОтбораПроб,
	|	ПротоколИспытаний.ИспытанияПроизвел КАК ИспытанияПроизвел,
	|	ПротоколИспытаний.КоличествоБракованныхУЕ КАК КоличествоБракованныхУЕ,
	|	ПротоколИспытаний.МестоОтбораПроб КАК МестоОтбораПроб,
	|	ПротоколИспытаний.Номер КАК Номер,
	|	ПротоколИспытаний.ОбъектИспытания КАК ОбъектИспытания,
	|	ПротоколИспытаний.ОбъемВыборки КАК ОбъемВыборки,
	|	ПротоколИспытаний.РазмерПартии КАК РазмерПартии,
	|	ПротоколИспытаний.ТНПА КАК ТНПА,
	|	ПротоколИспытаний.ТНПА2 КАК ТНПА2,
	|	ПротоколИспытаний.УсловияПроведенияИспытаний.(
	|		НаименованиеПоказателя КАК НаименованиеПоказателя,
	|		ВНачалеИспытания КАК ВНачалеИспытания,
	|		ВКонцеИспытания КАК ВКонцеИспытания
	|	) КАК УсловияПроведенияИспытаний,
	|	ПротоколИспытаний.СведенияОИОиСИ.(
	|		НаименованиеИОиСИ КАК НаименованиеИОиСИ,
	|		НаименованиеИОиСИ.ЗаводскойНомер КАК НаименованиеИОиСИЗаводскойНомер,
	|		НаименованиеИОиСИ.ДатаПроверки КАК НаименованиеИОиСИДатаПроверки,
	|		НаименованиеИОиСИ.СледующаяПроверка КАК НаименованиеИОиСИСледующаяПроверка
	|	) КАК СведенияОИОиСИ,
	|	НаименованиеОрганизации.Значение КАК НаименованиеОрганизации,
	|	Руководитель.Значение.Должность.Наименование КАК ДолжностьРуководителя,
	|	Руководитель.Значение.ФамилияИнициалы КАК РуководительФамилияИнициалы,
	|	ПротоколИспытаний.НомерПартии КАК НомерПартии,
	|	ПротоколИспытаний.ОбъектИспытания.ЕдиницыИзмерения.Наименование КАК ОбъектИспытанияЕдиницыИзмеренияНаименование,
	|	ПротоколИспытаний.ДатаРозлива КАК ДатаРозлива,
	|	ПротоколИспытаний.ДатаИзготовления КАК ДатаИзготовления
	|ИЗ
	|	Документ.ПротоколИспытаний КАК ПротоколИспытаний,
	|	Константа.НаименованиеОрганизации КАК НаименованиеОрганизации,
	|	Константа.Руководитель КАК Руководитель
	|ГДЕ
	|	ПротоколИспытаний.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьУсловияПроведенияИспытанийШапка = Макет.ПолучитьОбласть("УсловияПроведенияИспытанийШапка");
	ОбластьУсловияПроведенияИспытаний = Макет.ПолучитьОбласть("УсловияПроведенияИспытаний");
	ОбластьСведенияОИОиСИШапка = Макет.ПолучитьОбласть("СведенияОИОиСИШапка");
	ОбластьСведенияОИОиСИ = Макет.ПолучитьОбласть("СведенияОИОиСИ");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.ДатаДокумента = Формат(Выборка.Дата, "ДЛФ=DD");
		Шапка.Параметры.ДатаПроведенияИспытаний = Формат(Выборка.ДатаПроведенияИспытаний, "ДФ=dd.MM.yyyy");
		СведенияОПродукции = Выборка.ОбъектИспытания.Наименование + " партия " + Выборка.НомерПартии + ", дата изготовления:" + Формат(Выборка.ДатаИзготовления, "ДФ=dd.MM.yy") +"г.";
		Если Выборка.ДатаРозлива <> '00010101000000' Тогда
			СведенияОПродукции = СведенияОПродукции +" дата розлива:" + Формат(Выборка.ДатаРозлива, "ДФ=dd.MM.yy") +"г."
		КонецЕсли;
		Шапка.Параметры.СведенияОПродукции = СведенияОПродукции;
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьУсловияПроведенияИспытанийШапка);
		ВыборкаУсловияПроведенияИспытаний = Выборка.УсловияПроведенияИспытаний.Выбрать();
		Пока ВыборкаУсловияПроведенияИспытаний.Следующий() Цикл
			ОбластьУсловияПроведенияИспытаний.Параметры.Заполнить(ВыборкаУсловияПроведенияИспытаний);
			ТабДок.Вывести(ОбластьУсловияПроведенияИспытаний, ВыборкаУсловияПроведенияИспытаний.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьСведенияОИОиСИШапка);
		ВыборкаСведенияОИОиСИ = Выборка.СведенияОИОиСИ.Выбрать();
		Пока ВыборкаСведенияОИОиСИ.Следующий() Цикл
			ОбластьСведенияОИОиСИ.Параметры.Заполнить(ВыборкаСведенияОИОиСИ);
			ОбластьСведенияОИОиСИ.Параметры.НаименованиеИОиСИДатаПроверки = Формат(ВыборкаСведенияОИОиСИ.НаименованиеИОиСИДатаПроверки, "ДФ=dd.MM.yyyy");
			ОбластьСведенияОИОиСИ.Параметры.НаименованиеИОиСИСледующаяПроверка = Формат(ВыборкаСведенияОИОиСИ.НаименованиеИОиСИСледующаяПроверка, "ДФ=dd.MM.yyyy");
			ТабДок.Вывести(ОбластьСведенияОИОиСИ, ВыборкаСведенияОИОиСИ.Уровень());
		КонецЦикла;
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
		
		
		
		
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
