
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Производство") Тогда
			ОбъектИспытания = ДанныеЗаполнения.ВидПродукции;
			МестоОтбораПроб = ДанныеЗаполнения.СкладПоступленияПродукции;
			РазмерПартии = ДанныеЗаполнения.ФактическиВыпущено;
		КонецЕсли;
	КонецПроцедуры
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
