
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Списание") Тогда
			//Автор = ДанныеЗаполнения.Автор;
			Комментарий = ДанныеЗаполнения.Комментарий;
			МестоОтбораПроб = ДанныеЗаполнения.ОбъектПроизводства;
			АктОтбораПроб = Формат(ДанныеЗаполнения.Дата, "ДФ=dd.MM.yyyy");
			ДокументОтбораПроб = ДанныеЗаполнения.Ссылка;
			ДатаПроведенияИспытаний = ДанныеЗаполнения.Ссылка.Дата+120;
			ТНПА = ДанныеЗаполнения.ТНПА;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СписаниеПробы.НаименованиеПроб КАК НаименованиеПроб,
			|	СписаниеПробы.ВеличинаПартии КАК ВеличинаПартии,
			|	СписаниеПробы.ДатаРозлива КАК ДатаРозлива,
			|	СписаниеПробы.НомерПартии КАК НомерПартии,
			|	СписаниеПробы.ЦельИсследования.Наименование КАК ПодстрокаОрган,
			|	СписаниеПробы.ВесПробы КАК ВесПробы,
			|	СписаниеПробы.ДатаИзготовления КАК ДатаИзготовления,
			|	СписаниеПробы.ТНПАНаОтборПроб КАК ТНПАНаОтборПроб,
			|	СписаниеПробы.ТНПА1 КАК ТНПА1,
			|	СписаниеПробы.НаименованиеПроб.ВидУпаковки.Наименование КАК НаименованиеПробВидУпаковкиНаименование
			|ИЗ
			|	Документ.Списание.Пробы КАК СписаниеПробы
			|ГДЕ
			|	СписаниеПробы.Ссылка = &ДанныеЗаполненияСсылка
			|	И ПОДСТРОКА(СписаниеПробы.ЦельИсследования.Наименование, 0, 5) = &НаименованиеЦели";
			
			Запрос.УстановитьПараметр("ДанныеЗаполненияСсылка", ДанныеЗаполнения.Ссылка);
			Запрос.УстановитьПараметр("НаименованиеЦели", "Орган");
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбъектИспытания = ВыборкаДетальныеЗаписи.НаименованиеПроб;
				РазмерПартии = ВыборкаДетальныеЗаписи.ВеличинаПартии;
				ОбъемВыборки = ВыборкаДетальныеЗаписи.ВесПробы;
				НомерПартии = ВыборкаДетальныеЗаписи.НомерПартии;
				ДатаИзготовления = ВыборкаДетальныеЗаписи.ДатаИзготовления;
				ДатаРозлива = ВыборкаДетальныеЗаписи.ДатаРозлива;
				ВидУпаковки = ВыборкаДетальныеЗаписи.НаименованиеПробВидУпаковкиНаименование;
				ТНПА = ВыборкаДетальныеЗаписи.ТНПА1;
				ТНПА2 = ВыборкаДетальныеЗаписи.ТНПАНаОтборПроб;
			КонецЦикла;
			
			
			
			
		КонецЕсли;
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		// регистр СведенияОИсследованиях
		Набор = РегистрыСведений.СведенияОИсследованиях.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументОтбораПроб.ВыпускПродукции.Ссылка);
		Набор.Прочитать();
		Для Каждого Запись Из Набор Цикл 
			Запись.ПротоколИспытаний= Истина;
			Запись.ПротоколИспытанийСсылка = Ссылка;
			Запись.СтсатусИспытаний = ОбщегоНазначенияСервер.ОпредлениеСтатусаИсследований(Запись.Арбитраж, Запись.Органолептика, Запись.ПротоколИспытаний);
			Если Набор.Модифицированность() Тогда
				Набор.Записать();
			КонецЕсли;
		КонецЦикла;
		
	КонецПроцедуры
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
