
#Область СлужебныеПроцедурыИФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		Движения.НормыСписанияПродукции.Записывать = Истина;
		Для Каждого ТекСтрокаГотоваяПродукция Из ГотоваяПродукция Цикл
			Движение = Движения.НормыСписанияПродукции.Добавить();
			Движение.Период = Дата;
			Движение.Продукция = Номенклатура;
			Движение.НижнийПредел = ТекСтрокаГотоваяПродукция.НижнийПредел;
			Движение.ВерхнийПредел = ТекСтрокаГотоваяПродукция.ВерхнийПредел;
			Движение.ПричинаСписания = ТекСтрокаГотоваяПродукция.ЦельСписания;
			Движение.КоличествоСписания = ТекСтрокаГотоваяПродукция.НовоеКоличество;
			Движение.Комментарий = Комментарий;
		КонецЦикла;
	КонецПроцедуры
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
