
#Область ОбработчикиКомандФормы

&НаСервере
Функция ЗаполнитьНаСервере(Контрагент, ДатаСкидок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкидкиСрезПоследних.Контрагент КАК Контрагент,
		|	СкидкиСрезПоследних.Номенклатура КАК Номенклатура,
		|	СкидкиСрезПоследних.Скидка КАК Скидка
		|ИЗ
		|	РегистрСведений.Скидки.СрезПоследних(&ДатаСкидок, ) КАК СкидкиСрезПоследних
		|ГДЕ
		|	СкидкиСрезПоследних.Скидка <> 0";
	
	Запрос.УстановитьПараметр("ДатаСкидок", ДатаСкидок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Массив = Новый Массив();
	СтруктураСтрокой = "";
	НужнаЗапятая = Ложь;
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая = Истина;
	КонецЦикла;
	Для Каждого Строка Из ТЗ Цикл
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Массив.Добавить(НоваяСтрока);
	КонецЦикла;
	Возврат Массив;

КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	Объект.Скидки.Очистить();
	СтарыеСкидки = ЗаполнитьНаСервере(Объект.Контрагент, Объект.Дата);
	Для Каждого СтрСкидки Из СтарыеСкидки Цикл
		СтрДок = Объект.Скидки.Добавить();
		СтрДок.Номенклатура = СтрСкидки.Номенклатура;
		СтрДок.ТекущаяСкидка = СтрСкидки.Скидка;
		СтрДок.НоваяСкидка = СтрСкидки.Скидка;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();     
    ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();	
    ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элементы.Скидки.Имя); 
    ПолеОформления.Использование = Истина;
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Скидки.ТекущаяСкидка");
    ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;    
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Скидки.НоваяСкидка");
    ЭлементОтбора.Использование  = Истина;
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ЦианТемный);
КонецПроцедуры

#КонецОбласти

