#Область СлужебныеПроцедурыИФункции

&НаСервере
// <Описание функции>
//
// Параметры:
//  Номенклатура  - Справочники.Номенклатура - Номенклатура
//                 
//  ДатаВыпуска  - Дата - Дата выпуска партии
//                 
//	НомерПартии  - Число - Номер партии
//
//	Склад  - Справочники.Склад - Склад оприходования продукции
//
// Возвращаемое значение:
//   Число   - Величина выпущенной партии
//
&НаСервере
Функция ВеличинаПартии(Номенклатура, ДатаВыпуска, НомерПартии, Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиОбороты.КоличествоПриход КАК КоличествоПриход
		|ИЗ
		|	РегистрНакопления.Остатки.Обороты(, , Регистратор, ) КАК ОстаткиОбороты
		|ГДЕ
		|	ОстаткиОбороты.Номенклатура = &Номенклатура
		|	И ОстаткиОбороты.НомерПартии = &НомерПартии
		|	И ОстаткиОбороты.ДатаВыпуска = &ДатаВыпуска
		|	И ОстаткиОбороты.Склад = &Склад
		|	И ОстаткиОбороты.Регистратор ССЫЛКА Документ.Производство";
	
	Запрос.УстановитьПараметр("ДатаВыпуска", ДатаВыпуска);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НомерПартии", НомерПартии);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.КоличествоПриход;
	КонецЦикла;
	
	
КонецФункции // ВеличинаПартии(Номенклатура, ДатаВыпуска, НомерПартии, Склад)


&НаСервере
Функция ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиОстатки.Склад КАК Склад,
		|	ОстаткиОстатки.НомерПартии КАК НомерПартии,
		|	ОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиОстатки.ДатаВыпуска КАК ДатаВыпуска
		|ИЗ
		|	РегистрНакопления.Остатки.Остатки(&Дата, ) КАК ОстаткиОстатки
		|ГДЕ
		|	ОстаткиОстатки.Номенклатура = &Номенклатура
		|	И ОстаткиОстатки.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Номенклатура", Параметры.ОстНоменклатура);
	Запрос.УстановитьПараметр("Дата", Параметры.ОстДата);
	Запрос.УстановитьПараметр("Склад", Параметры.ОстСклад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТО = ВыборПартии.Добавить();
		СтрокаТО.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		СтрокаТО.Склад = ВыборкаДетальныеЗаписи.Склад;
		СтрокаТО.НомерПартии = ВыборкаДетальныеЗаписи.НомерПартии;
		СтрокаТО.Остаток = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		СтрокаТО.ДатаВыпуска = ВыборкаДетальныеЗаписи.ДатаВыпуска;
		СтрокаТО.ОбъемПартии = ВеличинаПартии(ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.ДатаВыпуска, ВыборкаДетальныеЗаписи.НомерПартии, Параметры.ОстСклад);
	КонецЦикла;
		СтрокаТО = ВыборПартии.Добавить();
		СтрокаТО.Номенклатура = Параметры.ОстНоменклатура;
	
	
	ВыборПартии.Сортировать("ДатаВыпуска Убыв");
	
КонецФункции

&НаКлиенте
Процедура ВыборПартииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Элемент.ТекущиеДанные.Номенклатура);
	СЗ.Добавить(Элемент.ТекущиеДанные.Склад);
	СЗ.Добавить(Элемент.ТекущиеДанные.НомерПартии);
	СЗ.Добавить(Элемент.ТекущиеДанные.Остаток);
	СЗ.Добавить(Элемент.ТекущиеДанные.ОбъемПартии);
	СЗ.Добавить(Элемент.ТекущиеДанные.ДатаВыпуска);
	Закрыть(СЗ);
КонецПроцедуры

#КонецОбласти

