
#Область СлужебныеПроцедурыИФункции

Процедура Краткий(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.УчетТрудозатрат.ПолучитьМакет("Краткий");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетТрудозатрат.Автор,
		|	УчетТрудозатрат.Год,
		|	УчетТрудозатрат.Дата,
		|	УчетТрудозатрат.Месяц,
		|	УчетТрудозатрат.Номер,
		|	УчетТрудозатрат.Подразделение,
		|	УчетТрудозатрат.УчетЗатрат.(
		|		НомерСтроки,
		|		ВыпущеноПродукции,
		|		ВидТрудозатрат,
		|		ИтогоПоВиду
		|	)
		|ИЗ
		|	Документ.УчетТрудозатрат КАК УчетТрудозатрат
		|ГДЕ
		|	УчетТрудозатрат.Ссылка В (&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьУчетЗатратШапка = Макет.ПолучитьОбласть("УчетЗатратШапка");
		ОбластьУчетЗатрат = Макет.ПолучитьОбласть("УчетЗатрат");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьУчетЗатратШапка);
			ВыборкаУчетЗатрат = Выборка.УчетЗатрат.Выбрать();
			Пока ВыборкаУчетЗатрат.Следующий() Цикл
				ОбластьУчетЗатрат.Параметры.Заполнить(ВыборкаУчетЗатрат);
				ТабДок.Вывести(ОбластьУчетЗатрат, ВыборкаУчетЗатрат.Уровень());
			КонецЦикла;
			
			Подвал.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал);
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

Процедура Полный(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.УчетТрудозатрат.ПолучитьМакет("Полный");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетТрудозатрат.Автор,
		|	УчетТрудозатрат.Год,
		|	УчетТрудозатрат.Дата,
		|	УчетТрудозатрат.Месяц,
		|	УчетТрудозатрат.Номер,
		|	УчетТрудозатрат.Подразделение,
		|	УчетТрудозатрат.УчетЗатрат.(
		|		НомерСтроки,
		|		ВидТрудозатрат,
		|		Ч1,
		|		Ч2,
		|		Ч3,
		|		Ч4,
		|		Ч5,
		|		Ч6,
		|		Ч7,
		|		Ч8,
		|		Ч9,
		|		Ч10,
		|		Ч11,
		|		Ч12,
		|		Ч13,
		|		Ч14,
		|		Ч15,
		|		Ч16,
		|		Ч17,
		|		Ч18,
		|		Ч19,
		|		Ч20,
		|		Ч21,
		|		Ч22,
		|		Ч23,
		|		Ч24,
		|		Ч25,
		|		Ч26,
		|		Ч27,
		|		Ч28,
		|		Ч29,
		|		Ч30,
		|		Ч31,
		|		ИтогоПоВиду
		|	)
		|ИЗ
		|	Документ.УчетТрудозатрат КАК УчетТрудозатрат
		|ГДЕ
		|	УчетТрудозатрат.Ссылка В (&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьУчетЗатратШапка = Макет.ПолучитьОбласть("УчетЗатратШапка");
		ОбластьУчетЗатрат = Макет.ПолучитьОбласть("УчетЗатрат");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьУчетЗатратШапка);
			ВыборкаУчетЗатрат = Выборка.УчетЗатрат.Выбрать();
			Пока ВыборкаУчетЗатрат.Следующий() Цикл
				ОбластьУчетЗатрат.Параметры.Заполнить(ВыборкаУчетЗатрат);
				ТабДок.Вывести(ОбластьУчетЗатрат, ВыборкаУчетЗатрат.Уровень());
			КонецЦикла;
			
			Подвал.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал);
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

#КонецОбласти

