

#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура ОбработкаПроведения(Отказ, Режим)
		Движения.Остатки.Записывать = Истина;
		Для Каждого ТекСтрокаТЧ Из ТЧ Цикл
			Если ТекСтрокаТЧ.ФактическоеКоличество > ТекСтрокаТЧ.КоличествоНаСкладе Тогда
				Движение = Движения.Остатки.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Номенклатура = ТекСтрокаТЧ.Наименование;
				Движение.Склад = Склад;
				Движение.НомерПартии = ТекСтрокаТЧ.НомерПартии;
				Движение.ДатаВыпуска = ТекСтрокаТЧ.ДатаПартии;
				Движение.Количество = ТекСтрокаТЧ.ФактическоеКоличество - ТекСтрокаТЧ.КоличествоНаСкладе;
			ИначеЕсли ТекСтрокаТЧ.ФактическоеКоличество < ТекСтрокаТЧ.КоличествоНаСкладе Тогда
				Движение = Движения.Остатки.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Номенклатура = ТекСтрокаТЧ.Наименование;
				Движение.Склад = Склад;
				Движение.НомерПартии = ТекСтрокаТЧ.НомерПартии;
				Движение.ДатаВыпуска = ТекСтрокаТЧ.ДатаПартии;
				Движение.Количество = (ТекСтрокаТЧ.ФактическоеКоличество - ТекСтрокаТЧ.КоличествоНаСкладе)*(-1);
			ИначеЕсли ТекСтрокаТЧ.ФактическоеКоличество = ТекСтрокаТЧ.КоличествоНаСкладе Тогда
				
			КонецЕсли;	
		КонецЦикла;
	КонецПроцедуры
	
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
