
#Область СлужебныеПроцедурыИФункции

Процедура СписокОтгрузок(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.Отгрузка.ПолучитьМакет("СписокОтгрузок");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Отгрузка.Дата,
		|	Отгрузка.Номер,
		|	Отгрузка.Отгрузки.(
		|		НомерСтроки,
		|		Контрагент,
		|		ПунктРазгрузки,
		|		Номенклатура,
		|		НомерПартии,
		|		Количество
		|	)
		|ИЗ
		|	Документ.Отгрузка КАК Отгрузка
		|ГДЕ
		|	Отгрузка.Ссылка В (&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьОтгрузкиШапка = Макет.ПолучитьОбласть("ОтгрузкиШапка");
		ОбластьОтгрузки = Макет.ПолучитьОбласть("Отгрузки");
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьОтгрузкиШапка);
			ВыборкаОтгрузки = Выборка.Отгрузки.Выбрать();
			Пока ВыборкаОтгрузки.Следующий() Цикл
				ОбластьОтгрузки.Параметры.Заполнить(ВыборкаОтгрузки);
				ТабДок.Вывести(ОбластьОтгрузки, ВыборкаОтгрузки.Уровень());
			КонецЦикла;
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
		
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

#КонецОбласти
