
#Область СлужебныеПроцедурыИФункции

Процедура Печать(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.НормыРасхода.ПолучитьМакет("Печать");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НормыРасхода.Дата КАК Дата,
		|	НормыРасхода.Номер КАК Номер,
		|	НормыРасхода.Продукция КАК Продукция,
		|	НормыРасхода.Материалы.(
		|		ЕдиницыИзмерения КАК ЕдиницыИзмерения,
		|		Материал КАК Материал,
		|		НовоеКоличество КАК НовоеКоличество
		|	) КАК Материалы,
		|	НормыРасхода.Продукция.ЕдиницыИзмерения.Наименование КАК ПродукцияЕдиницыИзмеренияНаименование,
		|	НаименованиеОрганизации.Значение КАК НаименованиеОрганизации,
		|	Руководитель.Значение.ФамилияИнициалы КАК ФамилияИнициалыРуководителя,
		|	ОтветственныйЗаКалькуляцию.Значение КАК ОтветственныйЗаКалькуляцию
		|ИЗ
		|	Документ.НормыРасхода КАК НормыРасхода,
		|	Константа.НаименованиеОрганизации КАК НаименованиеОрганизации,
		|	Константа.Руководитель КАК Руководитель,
		|	Константа.ОтветственныйЗаКалькуляцию КАК ОтветственныйЗаКалькуляцию
		|ГДЕ
		|	НормыРасхода.Ссылка В(&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьМатериалыШапка = Макет.ПолучитьОбласть("МатериалыШапка");
		ОбластьМатериалы = Макет.ПолучитьОбласть("Материалы");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			
			
			Шапка.Параметры.Заполнить(Выборка);
			Шапка.Параметры.ДатаПрописью = Формат(Выборка.Дата, "ДЛФ=DD");
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ОбластьМатериалыШапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОбластьМатериалыШапка);
			ВыборкаМатериалы = Выборка.Материалы.Выбрать();
			Нумератор = 1;		
			Пока ВыборкаМатериалы.Следующий() Цикл
				Если ВыборкаМатериалы.НовоеКоличество <> 0 Тогда
					НомерСтроки = Нумератор;
					ОбластьМатериалы.Параметры.Заполнить(ВыборкаМатериалы);
					ОбластьМатериалы.Параметры.ЕдиницыИзмерения = ВыборкаМатериалы.Материал.ЕдиницыИзмерения;
					ОбластьМатериалы.Параметры.НомерСТроки = Нумератор;
					Нумератор = Нумератор + 1;
					ТабДок.Вывести(ОбластьМатериалы, ВыборкаМатериалы.Уровень());
				КонецЕсли;
			КонецЦикла;
			
			ОбластьПодвал.Параметры.ДолжностьОтветственного = Выборка.ОтветственныйЗаКалькуляцию.Должность;
			ОбластьПодвал.Параметры.ФИООтвественного = Выборка.ОтветственныйЗаКалькуляцию.ФамилияИнициалы;
			ТабДок.Вывести(ОбластьПодвал);
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

#КонецОбласти
