

#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура ОбработкаПроведения(Отказ, Режим)
		// регистр НормыРасхода
		Движения.НормыРасхода.Записывать = Истина;
		Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
			Движение = Движения.НормыРасхода.Добавить();
			Движение.Период = Дата;
			Движение.Продукция = Продукция;
			Движение.Материал = ТекСтрокаМатериалы.Материал;
			Движение.Количество = ТекСтрокаМатериалы.НовоеКоличество;
		КонецЦикла;
	КонецПроцедуры
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
