
#Область ОбработчикиСобытийЭлементовТаблицыФормыПробы

&НаКлиенте
Процедура ПробыНаименованиеПробОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормы", ЭтаФорма);
	
	КлючЗаписи = Новый Структура;
	КлючЗаписи.Вставить("ОстДата", Объект.Дата);
	КлючЗаписи.Вставить("ОстНоменклатура", ВыбранноеЗначение);
	КлючЗаписи.Вставить("ОстСклад", Объект.Склад);
	// ОткрытьФорму("ОбщаяФорма.ФормаПодбора", КлючЗаписи,,,,,Оп);
	ОткрытьФорму("Документ.Списание.Форма.ФормаПодбораПартии", КлючЗаписи,,,,,Оп);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для Каждого ТекущаяСтрока Из Объект.Пробы Цикл
		РеальныйОстаток = ОстаткиНоменклатуры2(Объект.Дата, Объект.Склад, ТекущаяСтрока.НаименованиеПроб, ТекущаяСтрока.НомерПартии);
		Если РеальныйОстаток < ТекущаяСтрока.ВесПробы Тогда
			ТекстСообщения =  СтрШаблон(НСтр("ru='Ошибка. %1 недостаточно на складе'"), ТекущаяСтрока.НаименованиеПроб);
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект), ТекстСообщения);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(ДополнительныеПараметры) Экспорт
	ВременнаяПеременная = 1; // Сюда надо что-то написать, потому что процедура не может быть пустой, но она должна быть, без нее не работает
КонецПроцедуры

&НаСервере
Функция ОстаткиНоменклатуры2(ОстДата, ОстСклад, ОстНоменклатура, НомерПартии)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ТовОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.Остатки.Остатки(&ОстДата, ) КАК ТовОстатки
	|ГДЕ
	|	ТовОстатки.Склад = &ОстСклад
	|	И ТовОстатки.Номенклатура = &ОстНоменклатура
	|	И ТовОстатки.НомерПартии = &НомерПартии";
	
	Запрос.УстановитьПараметр("ОстДата", ОстДата);
	Запрос.УстановитьПараметр("ОстСклад", ОстСклад);
	Запрос.УстановитьПараметр("ОстНоменклатура", ОстНоменклатура);
	Запрос.УстановитьПараметр("НомерПартии", НомерПартии);
	
	Записи = Запрос.Выполнить().Выбрать();
	Пока Записи.Следующий() Цикл 
		Возврат (Записи.КоличествоОстаток);
	КонецЦикла;
	Возврат 0;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = ОбщегоНазначенияСервер.ПроверкаПраваНаРедактированиеДокумента(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормы(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если Не РезультатЗакрытия = Неопределено Тогда
		Элементы.Пробы.ТекущиеДанные.НаименованиеПроб = РезультатЗакрытия[0].Значение;
		Элементы.Пробы.ТекущиеДанные.ДатаИзготовления = РезультатЗакрытия[5].Значение;
		Элементы.Пробы.ТекущиеДанные.ВеличинаПартии = РезультатЗакрытия[4].Значение; //вот тут косяк
		Элементы.Пробы.ТекущиеДанные.НомерПартии = РезультатЗакрытия[2].Значение;
	КонецЕсли;
	
	ЗначениеВовзратаМасла = ОбщегоНазначенияСервер.ЕстьВозратМасла(Элементы.Пробы.ТекущиеДанные.НаименованиеПроб);
	Если ТипЗнч(ЗначениеВовзратаМасла) <> "Булево" Тогда
		Если ЗначениеВовзратаМасла > 0 Тогда
			ПолуфарикатВозврата = ОбщегоНазначенияСервер.УзнатьПолуфабрикат(Элементы.Пробы.ТекущиеДанные.НаименованиеПроб, Объект.Дата);
			Если ТипЗнч(ЗначениеВовзратаМасла) <> "Булево" Тогда
				Объект.ВидМасла = ПолуфарикатВозврата;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	СкладДляВозврата = ОпределитьСкладВозврата(Элементы.Пробы.ТекущиеДанные.НаименованиеПроб, Элементы.Пробы.ТекущиеДанные.НомерПартии, Элементы.Пробы.ТекущиеДанные.ДатаИзготовления);
	Если СкладДляВозврата <> Неопределено Тогда
		Объект.СкладВозвратаМасла = СкладДляВозврата;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьСкладВозврата(Номенклатура, НомерПартии, ДатаПартии)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Производство.СкладСписанияСырья КАК СкладСписанияСырья
		|ИЗ
		|	РегистрНакопления.Остатки.Обороты КАК ОстаткиОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Производство КАК Производство
		|		ПО ОстаткиОбороты.Номенклатура = Производство.ВидПродукции
		|			И ОстаткиОбороты.НомерПартии = Производство.НомерПартии
		|			И ОстаткиОбороты.ДатаВыпуска = Производство.ДатаРозлива
		|ГДЕ
		|	ОстаткиОбороты.Номенклатура = &Номенклатура
		|	И ОстаткиОбороты.НомерПартии = &НомерПартии
		|	И ОстаткиОбороты.ДатаВыпуска = &ДатаВыпуска";
	
	Запрос.УстановитьПараметр("ДатаВыпуска", ДатаПартии);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НомерПартии", НомерПартии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СкладСписанияСырья;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции
#КонецОбласти

