#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент;
	ПутевойЛист(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ПутевойЛист(ТабДок, ПараметрКоманды)
	Документы.ПутевойЛистЛегковогоАвтомобиля.ПутевойЛист(ТабДок, ПараметрКоманды);
КонецПроцедуры

#КонецОбласти

