
#Область ОбработчикиСобытийЭлементовТаблицыФормыЦены

&НаСервере
Функция ЗаполнитьНаСервере(ВыбраннаяДата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрейскурантСрезПоследних.Номенклатура КАК Номенклатура,
		|	ПрейскурантСрезПоследних.Цена КАК Цена,
		|	ПрейскурантСрезПоследних.Период КАК Период,
		|	ПрейскурантСрезПоследних.НДС КАК НДС,
		|	ПрейскурантСрезПоследних.НеВключатьВПрайс КАК НеВключатьВПрайс,
		|	ПрейскурантСрезПоследних.НомерСтрокиВПрейскуранте КАК НомерСтрокиВПрейскуранте
		|ИЗ
		|	РегистрСведений.Прейскурант.СрезПоследних(&ВыбраннаяДата, ) КАК ПрейскурантСрезПоследних
		|ГДЕ
		|	ПрейскурантСрезПоследних.Цена > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтрокиВПрейскуранте";
	
	Запрос.УстановитьПараметр("ВыбраннаяДата", ВыбраннаяДата);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ = РезультатЗапроса.Выгрузить();
	Массив = Новый Массив();
	СтруктураСтрокой = "";
	НужнаЗапятая = Ложь;
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая = Истина;
	КонецЦикла;
	Для Каждого Строка Из ТЗ Цикл
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Массив.Добавить(НоваяСтрока);
	КонецЦикла;
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура ЦеныНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаДанных = Элементы.Цены.ТекущиеДанные;
	Если Не ПустаяСтрока(СтрокаДанных.НДС) Тогда
		СтрокаДанных.СтараяЦена = ВозвратСтаройЦены(ВыбранноеЗначение, СтрокаДанных.НДС, Объект.Дата);
		СтрокаДанных.СтараяЦенаСНДС = СтрокаДанных.СтараяЦена * (1+(ВозвратНДС(СтрокаДанных.НДС)/100));
		СтрокаДанных.НоваяЦена = СтрокаДанных.СтараяЦена;
		СтрокаДанных.НоваяЦенаСНДС = СтрокаДанных.НоваяЦена * (1+(ВозвратНДС(СтрокаДанных.НДС)/100));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНДСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаДанных = Элементы.Цены.ТекущиеДанные;
	Если Не ПустаяСтрока(СтрокаДанных.Номенклатура) Тогда
		СтрокаДанных.СтараяЦена = ВозвратСтаройЦены(СтрокаДанных.Номенклатура, ВыбранноеЗначение, Объект.Дата);
		СтрокаДанных.СтараяЦенаСНДС = СтрокаДанных.СтараяЦена * (1+(ВозвратНДС(ВыбранноеЗначение)/100));
		СтрокаДанных.НоваяЦена = СтрокаДанных.НоваяЦена;
		СтрокаДанных.НоваяЦенаСНДС = СтрокаДанных.НоваяЦена * (1+(ВозвратНДС(ВыбранноеЗначение)/100));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНоваяЦенаПриИзменении(Элемент)
	СтрокаДанных = Элементы.Цены.ТекущиеДанные;
	СтрокаДанных.НоваяЦенаСНДС = СтрокаДанных.НоваяЦена * (1+(ВозвратНДС(СтрокаДанных.НДС)/100));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	Объект.Цены.Очистить();
	МассивЦен = ЗаполнитьНаСервере(Объект.Дата);
	Для Каждого СтрокаЗаполнения Из МассивЦен Цикл
			СтрокаДобавления = Объект.Цены.Добавить();
			СтрокаДобавления.Номенклатура = СтрокаЗаполнения.Номенклатура;
			СтрокаДобавления.НДС = СтрокаЗаполнения.НДС;
			СтрокаДобавления.СтараяЦена = СтрокаЗаполнения.Цена;
			СтрокаДобавления.СтараяЦенаСНДС = СтрокаЗаполнения.Цена * (1+(ВозвратНДС(СтрокаЗаполнения.НДС)/100));
			СтрокаДобавления.НоваяЦена = СтрокаЗаполнения.Цена;
			СтрокаДобавления.НоваяЦенаСНДС  = СтрокаЗаполнения.Цена * (1+(ВозвратНДС(СтрокаЗаполнения.НДС)/100));
			СтрокаДобавления.НеВключатьВПрайс = СтрокаЗаполнения.НеВключатьВПрайс;
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВозвратНДС(СтавкаНДС)
	 НДС = СтавкаНДС.Значение;
	 Возврат НДС;
КонецФункции

&НаСервереБезКонтекста
Функция ВозвратСтаройЦены(Номенклатура, НДС, ДатаПрейскуранта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрейскурантСрезПоследних.Период КАК Период,
		|	ПрейскурантСрезПоследних.Регистратор КАК Регистратор,
		|	ПрейскурантСрезПоследних.НомерСтроки КАК НомерСтроки,
		|	ПрейскурантСрезПоследних.Активность КАК Активность,
		|	ПрейскурантСрезПоследних.Номенклатура КАК Номенклатура,
		|	ПрейскурантСрезПоследних.НДС КАК НДС,
		|	ПрейскурантСрезПоследних.Цена КАК Цена,
		|	ПрейскурантСрезПоследних.НеВключатьВПрайс КАК НеВключатьВПрайс
		|ИЗ
		|	РегистрСведений.Прейскурант.СрезПоследних(&ДатаПрейскуранта, ) КАК ПрейскурантСрезПоследних
		|ГДЕ
		|	ПрейскурантСрезПоследних.Номенклатура = &Номенклатура
		|	И ПрейскурантСрезПоследних.НДС = &НДС";
	
	Запрос.УстановитьПараметр("ДатаПрейскуранта", ДатаПрейскуранта);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НДС", НДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Цена;
	КонецЦикла;
	
	Возврат 0;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();     
    ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();	
    ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элементы.Цены.Имя); 
    ПолеОформления.Использование = Истина;
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Цены.СтараяЦена");
    ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;    
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цены.НоваяЦена");
    ЭлементОтбора.Использование  = Истина;
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ЦианТемный);
КонецПроцедуры

#КонецОбласти


