
#Область ОбработчикиСобытийЭлементовТаблицыФормыДействительныеОбъемы

&НаКлиенте
Процедура ДействительныйОбъемПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	СуммаОбъема = 0;
	Для Каждого СтрокаОбъемов Из Объект.ДействительныеОбъемы Цикл
		СуммаОбъема = СуммаОбъема + СтрокаОбъемов.ДействительныйОбъем;
	КонецЦикла;
	Элементы.СреднееОбъема.Заголовок = НСтр("ru='Среднее арифметическое объема:'") + " " + Строка(Окр((СуммаОбъема/Объект.ДействительныеОбъемы.Количество()),2,РежимОкругления.Окр15как20));
КонецПроцедуры

&НаСервере
Процедура ДокументОтбораПробПриИзмененииНаСервере(ДокументОтбораПроб)
	СпиокПараметорПартии = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Списание.Пробы.(
		|		НаименованиеПроб КАК НаименованиеПроб,
		|		НомерПартии КАК НомерПартии,
		|		ВеличинаПартии КАК ВеличинаПартии
		|	) КАК Пробы,
		|	Списание.Дата КАК Дата
		|ИЗ
		|	Документ.Списание КАК Списание
		|ГДЕ
		|	Списание.Ссылка = &ДокументОтбораПроб";
	
	Запрос.УстановитьПараметр("ДокументОтбораПроб", ДокументОтбораПроб.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ааа = 1;
	КонецЦикла;
	
	
	
	//СпиокПараметорПартии.Вставить("ОбъектИспытания", ДокументОтбораПроб.
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОтбораПробПриИзменении(Элемент)
	ДокументОтбораПробПриИзмененииНаСервере(Объект.ДокументОтбораПроб);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументЖурнала(Команда)
	Если ЭтаФорма.Модифицированность Тогда
		Сообщить("Текущий документ незаписан");
		Возврат;
	КонецЕсли;
	ИмяДокумента = СтрЗаменить("СоздатьДокументЖ3", "Создать", "");
	ИмяДокумента = СтрЗаменить(ИмяДокумента, "ДокументЖ", "Журнал");
	
	ПараметрыНовогоДокумента = Новый Структура;
	ПараметрыНовогоДокумента.Вставить("ДокументИспытаний", Объект.Ссылка);
	ПараметрыНовогоДокумента.Вставить("ДокументОтбораПроб", Объект.ДокументОтбораПроб);
	
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормы", ЭтаФорма);
	ОткрытьФорму("Документ."+ИмяДокумента+".ФормаОбъекта",ПараметрыНовогоДокумента,,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормы(РезультатЗакрытия, ДопПараметры) Экспорт
	Если Не ЗначениеЗаполнено(Объект.Журнал3) Тогда
		Объект.Журнал3 = РезультатЗакрытия;
	КонецЕсли;
	
	
	
КонецПроцедуры

#КонецОбласти
