
#Область ОбработчикиСобытийЭлементовТаблицыФормыДействительныеОбъемы

&НаКлиенте
Процедура ДействительныйОбъемПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	СуммаОбъема = 0;
	Для Каждого СтрокаОбъемов Из Объект.ДействительныеОбъемы Цикл
		СуммаОбъема = СуммаОбъема + СтрокаОбъемов.ДействительныйОбъем;
	КонецЦикла;
	Элементы.СреднееОбъема.Заголовок = НСтр("ru='Среднее арифметическое объема:'") + " " + Строка(Окр((СуммаОбъема/Объект.ДействительныеОбъемы.Количество()),2,РежимОкругления.Окр15как20));
КонецПроцедуры

#КонецОбласти
