
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОтчетаПриИзменении(Элемент)
	Если Элемент.ВыделенныйТекст = "Остатки" Тогда
		УстановитьТекущийВариант("ОстаткиБезПартий");
		Элементы.НачальнаяДата.Видимость = Ложь;
		Отчет.НачальнаяДата = Null;
		Элементы.РазрезДат.Видимость = Ложь;
		Элементы.ПоПартиям.Видимость = Истина;
		Элементы.НулевыеОбороты.Видимость = Ложь;
		ПередатьПараметрыВКомпоновщик();
	Иначе 
		УстановитьТекущийВариант("Обороты");
		Элементы.НачальнаяДата.Видимость = Истина;
		Элементы.РазрезДат.Видимость = Истина;
		Элементы.ПоПартиям.Видимость = Ложь;
		Элементы.НулевыеОбороты.Видимость = Истина;
		ПередатьПараметрыВКомпоновщик();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоПартиямПриИзменении(Элемент)
	Если Отчет.ПоПартиям Тогда 
		УстановитьТекущийВариант("ОстаткиСПартиями"); 
	Иначе
		УстановитьТекущийВариант("ОстаткиБезПартий"); 
	КонецЕсли;
	ПередатьПараметрыВКомпоновщик();
КонецПроцедуры

&НаКлиенте
Процедура РазрезДатПриИзменении(Элемент)
	Если Отчет.ВРазрезеДат Тогда 
		УстановитьТекущийВариант("ОборотыПоДатам"); 
	Иначе
		УстановитьТекущийВариант("Обороты"); 
	КонецЕсли;
	ПередатьПараметрыВКомпоновщик();
КонецПроцедуры

&НаКлиенте
Процедура КонечнаяДатаПриИзменении(Элемент)
	ПередатьПараметрыВКомпоновщик();
КонецПроцедуры

&НаКлиенте
Процедура НачальнаяДатаПриИзменении(Элемент)
	ПередатьПараметрыВКомпоновщик();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ПередатьПараметрыВКомпоновщик();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ПередатьПараметрыВКомпоновщик();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПередатьПараметрыВКомпоновщик()
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", Отчет.НачальнаяДата);
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", Отчет.КонечнаяДата);
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Номенклатура", Отчет.Номенклатура);
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Склад", Отчет.Склад);
	Если ЗначениеЗаполнено(Отчет.Номенклатура) = Ложь  Тогда
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование = Ложь;
	Иначе
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование = Истина;
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = Отчет.Номенклатура;
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.Склад) = Ложь Тогда
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование = Ложь;
	Иначе
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование = Истина;
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].ПравоеЗначение = Отчет.Склад;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.ТипОтчета = Перечисления.ТипОтчетаОстатки.Остатки;
	УстановитьТекущийВариант("ОстаткиБезПартий"); 
	Элементы.НачальнаяДата.Видимость = Ложь;
	Элементы.РазрезДат.Видимость = Ложь;
	Отчет.НачальнаяДата = Null;
	Отчет.КонечнаяДата = ТекущаяДатаСеанса();
	Элементы.ПоПартиям.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПередатьПараметрыВКомпоновщик();
КонецПроцедуры

#КонецОбласти

