
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПротоколИспытаний)
	ТабДок = Новый ТабличныйДокумент;
	ПротоколИспытаний(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПротоколИспытаний(ТабДок, ПараметрКоманды)
	Документы.ПротоколИспытаний.ПротоколИспытаний(ТабДок, ПараметрКоманды);
КонецПроцедуры
