#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент;
	СписокОтгрузок(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура СписокОтгрузок(ТабДок, ПараметрКоманды)
	Документы.Отгрузка.СписокОтгрузок(ТабДок, ПараметрКоманды);
КонецПроцедуры

#КонецОбласти

