
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СырьеПродукцияЧтоОтправляемОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормы", ЭтаФорма);
	
	КлючЗаписи = Новый Структура;
	КлючЗаписи.Вставить("ОстДата", Объект.Дата);
	КлючЗаписи.Вставить("ОстНоменклатура", ВыбранноеЗначение);
	КлючЗаписи.Вставить("ОстСклад", Объект.СкладСырья);
	ОткрытьФорму("ОбщаяФорма.ФормаПодбора", КлючЗаписи,,,,,Оп);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормы(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если Не РезультатЗакрытия = Неопределено Тогда
		Элементы.СырьеПродукция.ТекущиеДанные.ЧтоОтправляем = РезультатЗакрытия[0].Значение;
		Элементы.СырьеПродукция.ТекущиеДанные.ДатаИзготовления = Объект.Дата;
		Элементы.СырьеПродукция.ТекущиеДанные.Остаток = РезультатЗакрытия[3].Значение;
		Если РезультатЗакрытия[2].Значение = "" Тогда 
			Элементы.СырьеПродукция.ТекущиеДанные.Партия = "001";
		Иначе 
			Элементы.СырьеПродукция.ТекущиеДанные.Партия = РезультатЗакрытия[2].Значение;
		КонецЕсли;
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

