// <Описание функции>
//
//
// Возвращаемое значение:
//   Ссылка   - Ссылка на номенклатуру "Контрольные знаки"
//
&НаСервере
Функция ПолучитьКЗ()
	Возврат Справочники.Номенклатура.НайтиПоНаименованию("Контрольные знаки").Ссылка;
КонецФункции // ПолучитьКЗ()

// <Описание функции>
//
// Параметры:
//  Серия  - Текст - Серия контрольных знаков
//  НачальныйНомер  - Число - Начальный номер КОнтрольных знаков
//  КоличествоКонтрольныхЗнаков  - Число - Количество приходуемых контрольных знаков
//
// Возвращаемое значение:
//   Булево   - Истина если все хорошо, Ложь, если есть совпадения
//
&НаСервере
Функция ПроверкаПриходаКЗ(Серия, НачальныйНомер, КоличествоКонтрольныхЗнаков)
	
	Для НомерКЗ = НачальныйНомер По НачальныйНомер + КоличествоКонтрольныхЗнаков - 1 Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиКЗ.Серия КАК Серия,
		|	ОстаткиКЗ.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.ОстаткиКЗ КАК ОстаткиКЗ
		|ГДЕ
		|	ОстаткиКЗ.Серия = &Серия
		|	И ОстаткиКЗ.Номер = &Номер";
		
		Запрос.Параметры.Вставить("Серия", Серия);
		Запрос.Параметры.Вставить("Номер", НомерКЗ);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат Ложь;
		КонецЦикла;
	КонецЦикла; 
	Возврат Истина;
КонецФункции // ПроверкаПриходаКЗ()


#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		Если Не ПроверкаПриходаКЗ(Серия, НачальныйНомер, КоличествоКонтрольныхЗнаков) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Контрольные знаки уже использовались и не могут быть поставлены на приход";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		// регистр ОстаткиКЗ
		Для НомерКЗ = НачальныйНомер По НачальныйНомер+КоличествоКонтрольныхЗнаков-1 Цикл
			Движения.ОстаткиКЗ.Записывать = Истина;
			Движение = Движения.ОстаткиКЗ.Добавить();
			Движение.Период = Дата;
			Движение.Серия = Серия;
			Движение.Номер = НомерКЗ;
			Движение.Состояние = Перечисления.ДвижениеКонтрольныхЗнаков.Поступление;
			Движение.Комментарий = Комментарий;
		КонецЦикла; 
		
		// регистр Остатки Приход
		Движения.Остатки.Записывать = Истина;
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Номенклатура = ПолучитьКЗ();
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Количество = КоличествоКонтрольныхЗнаков;
		Движение.Комментарий = Комментарий;
		
	КонецПроцедуры
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
