
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Соответствие") Тогда
		Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
			СтрокаНабора.ДокументУчетаУКЗ = ДанныеЗаполнения.Получить("ДокументУчетаУКЗ");
			СтрокаНабора.Период = ДанныеЗаполнения.Получить("Период");
			СтрокаНабора.Статус = ДанныеЗаполнения.Получить("Статус");
			СтрокаНабора.КодОтвета = ДанныеЗаполнения.Получить("КодОтвета");
			СтрокаНабора.ТекстОтвета = ДанныеЗаполнения.Получить("ТекстОтвета");
			СтрокаНабора.ИдентификаторОтчета = ДанныеЗаполнения.Получить("ИдентификаторОтчета");
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
