
&НаСервере
Процедура СформироватьНаСервере()
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(Метаданные.Документы.Производство);
	МассивДокументов.Добавить(Метаданные.Документы.ВнутреннееПеремещение);
	МассивДокументов.Добавить(Метаданные.Документы.Списание);
	МассивДокументов.Добавить(Метаданные.Документы.ПоступлениеМатериалов);
	
	ТекстЗапроса = "";
	Для каждого Вид Из МассивДокументов Цикл
		Если ТекстЗапроса<>"" Тогда
			ТекстЗапроса=ТекстЗапроса+"
			|ОБЪЕДИНИТЬ ВСЕ";
		КонецЕсли;         
		ТекстЗапроса = ТекстЗапроса+"
		|ВЫБРАТЬ Ссылка, Дата
		|ИЗ Документ."+Вид.Имя;
	КонецЦикла; 
	Запрос = Новый Запрос(ТекстЗапроса);
	
	ТЗДокументов = Запрос.Выполнить().Выгрузить();
	ТЗДокументов.Сортировать("Дата");
	
	СериализацияДокумента = Новый СериализаторXDTO(ФабрикаXDTO);
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("d:\test.txt");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("ВсеДокументы");
	Для каждого СтрокаТЗ Из ТЗДокументов Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");
		СериализацияДокумента.ЗаписатьXML(ЗаписьXML, СтрокаТЗ.Ссылка.ПолучитьОбъект(), НазначениеТипаXML.Неявное);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
