


#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура ОбработкаПроведения(Отказ, Режим)
		// регистр Остатки Приход
		Движения.Остатки.Записывать = Истина;
		Для Каждого ТекСтрокаВозвратныеТовары Из ВозвратныеТовары Цикл
			Движение = Движения.Остатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаВозвратныеТовары.Товар;
			Движение.Склад = ТекСтрокаВозвратныеТовары.Склад;
			Движение.НомерПартии = ТекСтрокаВозвратныеТовары.Партия;
			Движение.ДатаВыпуска = ТекСтрокаВозвратныеТовары.ДатаВыпуска;
			Движение.Количество = ТекСтрокаВозвратныеТовары.Количество;
		КонецЦикла;
	КонецПроцедуры
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
