
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Функция ВозвратМесяца(ДатаМесяца) 
	Возврат Перечисления.Месяцы[Месяц(ДатаМесяца)-1];
КонецФункции

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.Месяц = ВозвратМесяца(Объект.Дата);
	Объект.Год = Год(Объект.Дата);
	ВыпускиПродукции.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоМесяца(Объект.Дата));
	ВыпускиПродукции.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецМесяца(Объект.Дата));	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУчетЗатрат

&НаКлиенте
Процедура УчетЗатратПриИзменении(Элемент)
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	ТекущаяСтрока.ИтогоПоВиду = ТекущаяСтрока.Ч1 + ТекущаяСтрока.Ч2 + ТекущаяСтрока.Ч3 + ТекущаяСтрока.Ч4 + ТекущаяСтрока.Ч5 + ТекущаяСтрока.Ч6 + ТекущаяСтрока.Ч7 + ТекущаяСтрока.Ч8 + ТекущаяСтрока.Ч9 + ТекущаяСтрока.Ч10 
								+ ТекущаяСтрока.Ч11 + ТекущаяСтрока.Ч12 + ТекущаяСтрока.Ч13 + ТекущаяСтрока.Ч14 + ТекущаяСтрока.Ч15 + ТекущаяСтрока.Ч16 + ТекущаяСтрока.Ч17 + ТекущаяСтрока.Ч18 + ТекущаяСтрока.Ч19 + ТекущаяСтрока.Ч20 
								+ ТекущаяСтрока.Ч21 + ТекущаяСтрока.Ч22 + ТекущаяСтрока.Ч23 + ТекущаяСтрока.Ч24 + ТекущаяСтрока.Ч25 + ТекущаяСтрока.Ч26 + ТекущаяСтрока.Ч27 + ТекущаяСтрока.Ч28 + ТекущаяСтрока.Ч29 + ТекущаяСтрока.Ч30 + ТекущаяСтрока.Ч31;
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасчетВыпуска(Номенклатура, ДатаПериода, Склад)
	Если ЗначениеЗаполнено(Номенклатура.ПривязкаКПродукции) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ОстаткиОбороты.КоличествоПриход) КАК КоличествоПриход
		|ИЗ
		|	РегистрНакопления.Остатки.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК ОстаткиОбороты
		|ГДЕ
		|	ОстаткиОбороты.Номенклатура = &Номенклатура
		|	И ОстаткиОбороты.Склад = &Склад
		|	И ОстаткиОбороты.Регистратор ССЫЛКА Документ.Производство";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура.ПривязкаКПродукции);
		Если Номенклатура.ПривязкаКПродукции.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Продукция Тогда
			Запрос.УстановитьПараметр("Склад", Склад.СкладГотовойПродукции);
		Иначе 
			Запрос.УстановитьПараметр("Склад", Склад.СкладСырья);
		КонецЕсли;
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДатаПериода));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ДатаПериода));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.КоличествоПриход;
		КонецЦикла;
		Возврат 0;
	Иначе
		Возврат 0;
	КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура УчетЗатратВидТрудозатратОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Элементы.УчетЗатрат.ТекущиеДанные.ВыпущеноПродукции = РасчетВыпуска(ВыбранноеЗначение, Объект.Дата, Объект.Подразделение);
КонецПроцедуры

&НаКлиенте
Процедура ПересчетВыпусков(Команда)
	Для каждого СтрокаТрудозатрат Из Объект.УчетЗатрат Цикл
	    СтрокаТрудозатрат.ВыпущеноПродукции =  РасчетВыпуска(СтрокаТрудозатрат.ВидТрудозатрат, Объект.Дата, Объект.Подразделение);
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыпускиПродукции.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоМесяца(Объект.Дата));
	ВыпускиПродукции.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецМесяца(Объект.Дата));
	ВыпускиПродукции.Параметры.УстановитьЗначениеПараметра("СкладПродукции", Объект.Подразделение.СкладГотовойПродукции);
	ВыпускиПродукции.Параметры.УстановитьЗначениеПараметра("СкладСырья", Объект.Подразделение.СкладСырья);
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаСкладПродукции(СсылкаНаОбъект)
	Возврат СсылкаНаОбъект.СкладГотовойПродукции;
КонецФункции // ПолучитьСсылку()
 
Функция ПолучитьСсылкуНаСкладСырья(СсылкаНаОбъект)
	Возврат СсылкаНаОбъект.СкладСырья;
КонецФункции // ПолучитьСсылку()

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ВыпускиПродукции.Параметры.УстановитьЗначениеПараметра("СкладПродукции", ПолучитьСсылкуНаСкладПродукции(Объект.Подразделение));
	ВыпускиПродукции.Параметры.УстановитьЗначениеПараметра("СкладСырья", ПолучитьСсылкуНаСкладСырья(Объект.Подразделение));
КонецПроцедуры

&НаКлиенте
Процедура УчетЗатратПриАктивизацииЯчейки(Элемент)
	Если СтрНайти(Элемент.ТекущийЭлемент.Имя, "УчетЗатратЧ") <> 0  И Число(СтрЗаменить(Элемент.ТекущийЭлемент.Имя, "УчетЗатратЧ", "")) <= День(КонецМесяца(Объект.Дата))  Тогда
		ДатаДняВыбора = Дата(Год(Объект.Дата), Месяц(Объект.Дата), Число(СтрЗаменить(Элемент.ТекущийЭлемент.Имя, "УчетЗатратЧ", "")));
		ВыпускиПродукции.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(ДатаДняВыбора));
		ВыпускиПродукции.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ДатаДняВыбора));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

