
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбъемПроизводства(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.Производство.ПолучитьМакет("ОбъемПроизводства");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Производство.ВидПродукции КАК ВидПродукции,
		|	Производство.Дата КАК Дата,
		|	Производство.Номер КАК Номер,
		|	Производство.Автор КАК Автор,
		|	Производство.НомерПартии КАК НомерПартии,
		|	Производство.ДатаИзготовления КАК ДатаИзготовления,
		|	Производство.ДатаРозлива КАК ДатаРозлива,
		|	Производство.ДляМасла КАК ДляМасла,
		|	Производство.СырьеИМатериалы.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		Номенклатура.ЕдиницыИзмерения КАК ЕдиницыИзмерения,
		|		НормаРасхода КАК НормаРасхода,
		|		Количество КАК Количество
		|	) КАК СырьеИМатериалы,
		|	Производство.ЭтапыПроизводства.(
		|		КоличествоВыпуска КАК КоличествоВыпуска
		|	) КАК ЭтапыПроизводства,
		|	Производство.ВозвратныеОтходы.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Наименование КАК ВозвратныйОтход,
		|		Наименование.ЕдиницыИзмерения КАК ВозвратныйОтходЕИ,
		|		НормаВыхода КАК НормаВыхода,
		|		Количество КАК ВозвратныйОтходКол
		|	) КАК ВозвратныеОтходы,
		|	Производство.КонтрольныеЗнаки.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Серия КАК Серия,
		|		НачальныйНомер КАК НачальныйНомер,
		|		КонечныйНомер КАК КонечныйНомер,
		|		Количество КАК Количество,
		|		ПричинаСписания КАК ПричинаСписания
		|	) КАК КонтрольныеЗнаки
		|ИЗ
		|	Документ.Производство КАК Производство
		|ГДЕ
		|	Производство.Ссылка В(&Ссылка)";
		
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьЗаголовок.Параметры.Директор = Константы.Руководитель.Получить();
		Шапка1 = Макет.ПолучитьОбласть("Шапка1");
		
		Шапка2 = Макет.ПолучитьОбласть("Шапка2");
		Шапка3 = Макет.ПолучитьОбласть("Шапка3");
		
		Шапка4 = Макет.ПолучитьОбласть("Шапка4");
		ОбластьСырьеИМатериалыШапка = Макет.ПолучитьОбласть("СырьеИМатериалыШапка");
		ОбластьСырьеИМатериалы = Макет.ПолучитьОбласть("СырьеИМатериалы");
		ОбластьПодвал1 = Макет.ПолучитьОбласть("Подвал1");
		ОбластьПодвал2 = Макет.ПолучитьОбласть("Подвал2");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьУКЗШапка = Макет.ПолучитьОбласть("УКЗШапка");
		ОбластьУКЗШапкаТаблицы = Макет.ПолучитьОбласть("УКЗШапкаТаблицы");
		ОбластьУКЗСтрокаТаблицы = Макет.ПолучитьОбласть("УКЗСтрокаТаблицы");
		ОбластьУКЗПодвал = Макет.ПолучитьОбласть("УКЗПодвал");
		
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьЗаголовок);
			
			ВыборкаЭтапыПроизводства = Выборка.ЭтапыПроизводства.Выбрать();
			СумФактическиВыпущено = 0;
			Пока ВыборкаЭтапыПроизводства.Следующий() Цикл
				СумФактическиВыпущено = СумФактическиВыпущено + ВыборкаЭтапыПроизводства.КоличествоВыпуска;
			КонецЦикла;
			
			
			Шапка1.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Шапка1, Выборка.Уровень());
			
			Если Выборка.ДляМасла Тогда 
				Шапка3.Параметры.Заполнить(Выборка);
				Шапка3.Параметры.ДатаРозлива = Формат(Выборка.ДатаРозлива, "ДЛФ=ДД");  
				Шапка3.Параметры.ДатаИзготовления = Формат(Выборка.ДатаИзготовления, "ДЛФ=ДД");
				ТабДок.Вывести(Шапка3, Выборка.Уровень());
			Иначе 
				Шапка2.Параметры.Заполнить(Выборка);
				Шапка2.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=ДД");
				ТабДок.Вывести(Шапка2, Выборка.Уровень());
			КонецЕсли;
			
			Шапка4.Параметры.Заполнить(Выборка);
			Шапка4.Параметры.ФактическиВыпущено = СумФактическиВыпущено;
			Шапка4.Параметры.ЕдиницыИзмерения = Выборка.ВидПродукции.ЕдиницыИзмерения;
			ТабДок.Вывести(Шапка4, Выборка.Уровень());
			
			
			ОбластьСырьеИМатериалыШапка.Параметры.ЕдиницыИзмерения = Выборка.ВидПродукции.ЕдиницыИзмерения;
			ТабДок.Вывести(ОбластьСырьеИМатериалыШапка);
			ВыборкаСырьеИМатериалы = Выборка.СырьеИМатериалы.Выбрать();
			Пока ВыборкаСырьеИМатериалы.Следующий() Цикл
				ОбластьСырьеИМатериалы.Параметры.Заполнить(ВыборкаСырьеИМатериалы);
				ТабДок.Вывести(ОбластьСырьеИМатериалы, ВыборкаСырьеИМатериалы.Уровень());
			КонецЦикла;
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
		
		ОбластьПодвал1.Параметры.ВидПродукции = Выборка.ВидПродукции;
		ОбластьПодвал1.Параметры.ФактическиВыпущено = СумФактическиВыпущено;
		ОбластьПодвал1.Параметры.ЕдиницыИзмерения = Выборка.ВидПродукции.ЕдиницыИзмерения;
		
		ТабДок.Вывести(ОбластьПодвал1);
		
		ВыборкаВозвратныеОтходы = Выборка.ВозвратныеОтходы.Выбрать();
		Пока ВыборкаВозвратныеОтходы.Следующий() Цикл
			ОбластьПодвал2.Параметры.Заполнить(ВыборкаВозвратныеОтходы);
			ТабДок.Вывести(ОбластьПодвал2, ВыборкаВозвратныеОтходы.Уровень());
		КонецЦикла;
		
		ОбластьПодвал.Параметры.Мастер = Выборка.Автор;
		ОбластьПодвал.Параметры.НачПроизводства = Константы.НачальникПроизводства.Получить();
		ОбластьПодвал.Параметры.ДолжностьНачПроизводства = Константы.НачальникПроизводства.Получить().Должность.Наименование;
		
		ТабДок.Вывести(ОбластьПодвал);
		
		ПервыйПроход = 0;
		ВыборкаУКЗ = Выборка.КонтрольныеЗнаки.Выбрать();
		Пока ВыборкаУКЗ.Следующий() Цикл
			Если ПервыйПроход = 0 Тогда 
				ОбластьУКЗШапка.Параметры.Заполнить(Выборка);
				ТабДок.Вывести(ОбластьУКЗШапка);
				ТабДок.Вывести(ОбластьУКЗШапкаТаблицы);
				ПервыйПроход = 1;
			КонецЕсли;
			
			ОбластьУКЗСтрокаТаблицы.Параметры.Заполнить(ВыборкаУКЗ);
			ТабДок.Вывести(ОбластьУКЗСтрокаТаблицы, ВыборкаУКЗ.Уровень());
		КонецЦикла;
		Если ПервыйПроход = 1 Тогда
			ОбластьУКЗПодвал.Параметры.Мастер = Выборка.Автор;
			ТабДок.Вывести(ОбластьУКЗПодвал);
		КонецЕсли;
		
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли
КонецПроцедуры

#КонецОбласти
