
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Функция НоменклатураПриИзмененииНаСервере(ДатаПоказаний, Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НормыСписанияПродукцииСрезПоследних.Продукция КАК Продукция,
		|	НормыСписанияПродукцииСрезПоследних.НижнийПредел КАК НижнийПредел,
		|	НормыСписанияПродукцииСрезПоследних.ВерхнийПредел КАК ВерхнийПредел,
		|	НормыСписанияПродукцииСрезПоследних.ПричинаСписания КАК ПричинаСписания,
		|	НормыСписанияПродукцииСрезПоследних.КоличествоСписания КАК КоличествоСписания
		|ИЗ
		|	РегистрСведений.НормыСписанияПродукции.СрезПоследних(&ДатаПоказаний, ) КАК НормыСписанияПродукцииСрезПоследних
		|ГДЕ
		|	НормыСписанияПродукцииСрезПоследних.КоличествоСписания > 0
		|	И НормыСписанияПродукцииСрезПоследних.Продукция = &Номенклатура";
	
	Запрос.УстановитьПараметр("0", 0);
	Запрос.УстановитьПараметр("ДатаПоказаний", ДатаПоказаний);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	ТаблицаНорм = Новый ТаблицаЗначений;
	ТаблицаНорм = Запрос.Выполнить().Выгрузить();
	ТаблицаНорм.Сортировать("ПричинаСписания");
	
	Возврат ОбщегоНазначенияСервер.ТЗВМассив(ТаблицаНорм);

КонецФункции

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	МассивНорм = Новый Массив;
	МассивНорм = НоменклатураПриИзмененииНаСервере(Объект.Дата, Объект.Номенклатура);
	Для каждого СтрокаМассиваНорм Из МассивНорм Цикл
		СтрокаТаблицыНорм = Объект.ГотоваяПродукция.Добавить();
		СтрокаТаблицыНорм.НижнийПредел = СтрокаМассиваНорм.НижнийПредел;
		СтрокаТаблицыНорм.ВерхнийПредел = СтрокаМассиваНорм.ВерхнийПредел;
		СтрокаТаблицыНорм.ЦельСписания = СтрокаМассиваНорм.ПричинаСписания;
		СтрокаТаблицыНорм.СтароеКоличество = СтрокаМассиваНорм.КоличествоСписания;
		
		
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти

