
#Область ОбработчикиСобытийЭлементовТаблицыФормыНоменклатура

&НаКлиенте
Процедура Пересчет(СтрокаТЧ)
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
	СтрокаТЧ.СуммаСНДС = СтрокаТЧ.Сумма * ((100+ПолучитьЗначениеНДС(СтрокаТЧ.СтавкаНДС))/100);
	СтрокаТЧ.СуммаНДС = СтрокаТЧ.СуммаСНДС - СтрокаТЧ.Сумма;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьЗначениеНДС(СтавкаНДС)
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда
		Возврат СтавкаНДС.Значение;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции // ПолучитьЗначениеНДС()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТолькоПросмотр = ОбщегоНазначенияСервер.ПроверкаПраваНаРедактированиеДокумента(Объект);
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Номенклатура.ТекущиеДанные;
	Пересчет(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Номенклатура.ТекущиеДанные;
	Пересчет(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураСтавкаНДСПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Номенклатура.ТекущиеДанные;
	Пересчет(СтрокаТЧ);
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименование(Номенклатура)
	Возврат Номенклатура.Наименование;
КонецФункции


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для каждого СтрокаМатериалов Из Объект.Материалы Цикл
		Если ПолучитьНаименование(СтрокаМатериалов.Номенклатура)	= "Контрольные знаки" Тогда
			Сообщить("Контрольные знаки приходуются отдельным документом");
			Отказ = Истина;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти

