

#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Заявка Приход
	Движения.Заявка.Записывать = Истина;
	Для Каждого ТекСтрокаНоменклатура Из Продукция Цикл
		Движение = Движения.Заявка.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагенты = Контрагент;
		Движение.Номенклатура = ТекСтрокаНоменклатура.Номенклатура;
		Движение.ПунктыРазгрузки = Адрес;
		Движение.ДокументЗаявки = Ссылка;
		Движение.Заказано = ТекСтрокаНоменклатура.Количество;
	КонецЦикла;
КонецПроцедуры
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
