
#Область ОбработчикиСобытийЭлементовТаблицыФормыНоменклатура

&НаКлиенте
Процедура НоменклатураНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВернутьВидНоменклатуры2(ВыбранноеЗначение) = ВернутьВидНоменклатуры() Тогда
		Элементы.НоменклатураНомерПартии.Видимость = Истина;
		Элементы.НоменклатураДатаПартии.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для Каждого ТекущаяСтрока Из Объект.ПродукцияИСырье Цикл
		РеальныйОстаток = ОстаткиНоменклатуры2(Объект.Дата, Объект.СкладОтправитель, ТекущаяСтрока.Номенклатура);
		Если РеальныйОстаток < ТекущаяСтрока.Количество Тогда 
			ТекстСообщения =  СтрШаблон(НСтр("ru='Ошибка. %1 недостаточно на складе'"), ТекущаяСтрока.Номенклатура);
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект), ТекстСообщения);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(ДополнительныеПараметры) Экспорт
	
	ВременнаяПеременная = 1; // Сюда надо что-то написать, потому что процедура не может быть пустой, но она должна быть, без нее не работает

КонецПроцедуры

&НаСервере
Функция ОстаткиНоменклатуры2(ОстДата, ОстСклад, ОстНоменклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ТовОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.Остатки.Остатки(&ОстДата)
	|КАК 
	|	ТовОстатки
	|ГДЕ
	|	ТовОстатки.Склад = &ОстСклад И
	|	ТовОстатки.Номенклатура = &ОстНоменклатура";
	
	Запрос.УстановитьПараметр("ОстДата", ОстДата);
	Запрос.УстановитьПараметр("ОстСклад", ОстСклад);
	Запрос.УстановитьПараметр("ОстНоменклатура", ОстНоменклатура);
	
	Записи = Запрос.Выполнить().Выбрать();
	Пока Записи.Следующий() Цикл 
		Возврат (Записи.КоличествоОстаток);
	КонецЦикла;
	Возврат 0;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТолькоПросмотр = ОбщегоНазначенияСервер.ПроверкаПраваНаРедактированиеДокумента(Объект);
КонецПроцедуры

&НаСервере
Функция ВернутьВидНоменклатуры()
	Возврат Перечисления.ВидыНоменклатуры.Продукция;
КонецФункции

&НаСервере
Функция ВернутьВидНоменклатуры2(ВыбранноеЗначение)
	Возврат ВыбранноеЗначение.ВидНоменклатуры;
КонецФункции

#КонецОбласти


