
#Область ОбработчикиКомандФормы

&НаСервере
Функция ЗагрузитьНакладныеНаСервере()
	
	СпрКонтрагентов = Справочники.Контрагенты;
	СпрНоменклатуры = Справочники.Номенклатура;
	
	Для Каждого СтрТабНакладных Из Объект.СписокНакладных Цикл 
		Если СтрТабНакладных.СтатусЗагрузки Тогда
			Док = Документы.Заявка.СоздатьДокумент();
			Для Каждого ПодробнаяСтрокаТаблицыНакладных Из Объект.ПодробныйСписокНакладных Цикл
				Если СтрТабНакладных.НомерНакладной = ПодробнаяСтрокаТаблицыНакладных.НомерНакладной Тогда
					Док.Дата = НачалоДня(ПодробнаяСтрокаТаблицыНакладных.ДатаНакладной)+60;
					Док.Контрагент = СпрКонтрагентов.НайтиПоРеквизиту("УНП", ПодробнаяСтрокаТаблицыНакладных.УНП);
					Док.НомерИмпортированнойНакладной = ПодробнаяСтрокаТаблицыНакладных.НомерНакладной;
					НоваяСтрока = Док.Продукция.Добавить();
					НоваяСтрока.Номенклатура = СпрНоменклатуры.НайтиПоНаименованию(ПодробнаяСтрокаТаблицыНакладных.Номенклатура);
					НоваяСтрока.Количество = ПодробнаяСтрокаТаблицыНакладных.Количество;
				КонецЕсли;
			КонецЦикла;
			Док.Записать();
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьНакладные(Команда)
	ЗагрузитьНакладныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокНаСервере()
	База = Неопределено;
    РезультатПодключения = Неопределено;
    ОбщегоНазначенияСервер.ПодключениеК1С77(База, РезультатПодключения);

	Если НЕ РезультатПодключения Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "НЕ ПОДКЛЮЧИЛИСЬ К 1С 7.7";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли;
	ПодробнаяТаблицаНакладных = Объект.ПодробныйСписокНакладных;
	ПодробнаяТаблицаНакладных.Очистить();
	Док = База.CreateObject("Документ.Накладная");
	Док.ВыбратьДокументы(Объект.ДатаНачала,Объект.ДатаОкончания);                  
	Пока Док.ПолучитьДокумент() = 1 Цикл
		Если Док.ПометкаУдаления() = 0 Тогда
			Док.ВыбратьСтроки();
			Пока Док.ПолучитьСтроку()=1 Цикл
				нов=ПодробнаяТаблицаНакладных.Добавить();
				нов.НомерНакладной = СокрЛП(Док.НомерДок);
				нов.ДатаНакладной = Док.ДатаДок;
				нов.Покупатель = СокрЛП(Док.Получатель.Наименование);
				нов.УНП	= Док.Получатель.УНН;
				нов.Номенклатура = СокрЛП(Док.Товар.Наименование);
				Нов.Количество = Док.Количество;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;  
	Док=NULL;
	База=NULL;
	ТЗ = ПодробнаяТаблицаНакладных.Выгрузить();
	ТЗ.Свернуть("НомерНакладной, ДатаНакладной, УНП, Покупатель");
	ТаблицаНакладных = Объект.СписокНакладных;
	ТаблицаНакладных.Очистить();
	
	Для Каждого СтрТЗ Из ТЗ Цикл
		НоваяСтрока = ТаблицаНакладных.Добавить();
		НоваяСтрока.НомерНакладной = СтрТЗ.НомерНакладной;
		НоваяСтрока.ДатаНакладной = СтрТЗ.ДатаНакладной;
		НоваяСтрока.Контрагент = УзнатьКонтрагента(СтрТЗ.УНП, СтрТЗ.Покупатель);
		НоваяСтрока.СтатусНакладной = ?(СуществуетДокумент(СтрТЗ.НомерНакладной), НСтр("ru='Загружена'"), НСтр("ru='Не загружена'"));
		НоваяСтрока.СтатусЗагрузки = ?(НоваяСтрока.СтатусНакладной = "Загружена", Ложь, Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписок(Команда)
	ЗаполнитьСписокНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция УзнатьКонтрагента(УНП, НаименованиеПокупателя);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.УНП КАК УНП
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.УНП = &УНП";
	
	Запрос.УстановитьПараметр("УНП", УНП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	НовыйКонтрагент.УНП = УНП;
	НовыйКонтрагент.Наименование = СокрЛП(НаименованиеПокупателя);
	НовыйКонтрагент.Записать();
	Возврат НовыйКонтрагент.Ссылка;
КонецФункции

&НаСервере
Функция СуществуетДокумент(НомерДок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Заявка.НомерИмпортированнойНакладной КАК НомерИмпортированнойНакладной
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|ГДЕ
	|	Заявка.НомерИмпортированнойНакладной = &НомерДок";
	
	Запрос.УстановитьПараметр("НомерДок", НомерДок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
