
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Фамилия = "";
	Имя = "";
	Отчество = "";
	ФИО = СокрЛП(Элемент.ТекстРедактирования);
	
	ПервыйПробел = СтрНайти(ФИО, " ", НаправлениеПоиска.СНачала);
	ВторойПробел = СтрНайти(ФИО, " ", НаправлениеПоиска.СКонца);
	Фамилия = Сред(ФИО,1,ПервыйПробел-1);
	Имя = Сред(ФИО, ПервыйПробел+1, 1) + ".";
	Отчество = Сред(ФИО, ВторойПробел+1, 1) + ".";
	
	Объект.ФамилияИнициалы = Фамилия + " " + Имя + " " + Отчество;
КонецПроцедуры

#КонецОбласти
