#Область ПрограммныйИнтерфейс

// Вычисляет количество полных лет между двумя датами
//
// Параметры:
//  ДатаРождения  - Дата
//  ДатаСравнения  - Дата
//
// Возвращаемое значение:
//   Число   - полных лет
//
Функция ПолныхЛет(ДатаРождения, ДатаСравнения) Экспорт
	ГодНачала = Год(ДатаРождения);
	ГодОкончания = Год(НачалоГода(ДатаСравнения));
	ПолныхЛет = ГодОкончания - ГодНачала;
	Если Дата(ГодОкончания, Месяц(ДатаРождения), День(ДатаРождения)) > Дата(ГодОкончания, Месяц(НачалоГода(ДатаСравнения)), День(НачалоГода(ДатаСравнения))) Тогда
		ПолныхЛет = ПолныхЛет - 1;
	КонецЕсли; 
	Возврат ПолныхЛет;
КонецФункции

#КонецОбласти