
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(СлужебнаяЗаписка)
	ТабДок = Новый ТабличныйДокумент;
	СлужебнаяЗаписка(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура СлужебнаяЗаписка(ТабДок, ПараметрКоманды)
	Документы.Списание.СлужебнаяЗаписка(ТабДок, ПараметрКоманды);
КонецПроцедуры
