
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура ОбработкаПроведения(Отказ, Режим)
		// регистр Остатки Расход
		Движения.Остатки.Записывать = Истина;
		Для Каждого ТекСтрокаСырьеПродукция Из СырьеПродукция Цикл
			Движение = Движения.Остатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаСырьеПродукция.ЧтоОтправляем;
			Движение.Склад = СкладСырья;
			Движение.Количество = ТекСтрокаСырьеПродукция.СколькоОтправляем;
		КонецЦикла;
		
		// регистр Остатки Приход
		Движения.Остатки.Записывать = Истина;
		Для Каждого ТекСтрокаСырьеПродукция Из СырьеПродукция Цикл
			Движение = Движения.Остатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаСырьеПродукция.ЧтоПолучаем;
			Движение.Склад = СкладПродукции;
			Движение.НомерПартии = ТекСтрокаСырьеПродукция.Партия;
			Движение.Количество = ТекСтрокаСырьеПродукция.СколькоОтправляем;
		КонецЦикла;
	КонецПроцедуры
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
