#Область Инициализация

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Если Константы.БлокировкаБД.Получить() = Ложь Тогда
		Попытка
			УстановитьМонопольныйРежим(Истина);
			СообщениеОБлокировке = Новый СообщениеПользователю;
			СообщениеОБлокировке.Текст = НСтр("ru='Заблокировано'");
			СообщениеОБлокировке.Сообщить();
		Исключение
			СообщениеОБлокировке = Новый СообщениеПользователю;
			СообщениеОБлокировке.Текст = НСтр("ru='С информационной базой работают другие пользователи.'");
			СообщениеОБлокировке.Сообщить();
		КонецПопытки;
	Иначе 
		Попытка
			УстановитьМонопольныйРежим(Ложь);
			СообщениеОБлокировке = Новый СообщениеПользователю;
			СообщениеОБлокировке.Текст = НСтр("ru='Разблокировано'");
			СообщениеОБлокировке.Сообщить();
		Исключение
			СообщениеОБлокировке = Новый СообщениеПользователю;
			СообщениеОБлокировке.Текст = НСтр("ru='Что-то пошло не так.'");
			СообщениеОБлокировке.Сообщить();
		КонецПопытки;	
	КонецЕсли;
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти