#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент;
	ПрейскурантСКартинкой(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ПрейскурантСКартинкой(ТабДок, ПараметрКоманды)
	Документы.ПрейскурантЦен.ПрейскурантСКартинкой(ТабДок, ПараметрКоманды);
КонецПроцедуры

#КонецОбласти

