
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		Движения.Остатки.Записывать = Истина;
		Для Каждого ТекСтрокаНоменклатура Из Материалы Цикл
			Движение = Движения.Остатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаНоменклатура.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = ТекСтрокаНоменклатура.Количество;
		КонецЦикла;
		
		#Если Не МобильноеПриложениеСервер Тогда
			// регистр Управленческий 
			Движения.Управленческий.Записывать = Истина;
			Для Каждого ТекСтрокаНоменклатура Из Материалы Цикл
				Движение = Движения.Управленческий.Добавить();
				Движение.СчетДт = ПланыСчетов.Основной.СырьеИМатериалы;
				Движение.СчетКт = ПланыСчетов.Основной.РасчетыСПоставщикамиИПодрядчикамиВРублях;
				Движение.Период = Дата;
				Движение.Сумма = ТекСтрокаНоменклатура.Сумма;
				Движение.КоличествоДт = ТекСтрокаНоменклатура.Количество;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ТекСтрокаНоменклатура.Номенклатура;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.МестаХранения] = Склад;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Поставщик;
			КонецЦикла;
			
			// регистр Управленческий 
			Движения.Управленческий.Записывать = Истина;
			Для Каждого ТекСтрокаНоменклатура Из Материалы Цикл
				Движение = Движения.Управленческий.Добавить();
				Движение.СчетДт = ПланыСчетов.Основной.НДСПоТМЦ;
				Движение.СчетКт = ПланыСчетов.Основной.РасчетыСПоставщикамиИПодрядчикамиВРублях;
				Движение.Период = Дата;
				Движение.Сумма = ТекСтрокаНоменклатура.СуммаСНДС;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Поставщик;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Поставщик;
			КонецЦикла;
		#КонецЕсли
		
		
	КонецПроцедуры
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
