#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиОстатки.Склад КАК Склад,
		|	ОстаткиОстатки.НомерПартии КАК НомерПартии,
		|	ОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиОстатки.ДатаВыпуска КАК ДатаВыпуска
		|ИЗ
		|	РегистрНакопления.Остатки.Остатки(&Дата, ) КАК ОстаткиОстатки
		|ГДЕ
		|	ОстаткиОстатки.Номенклатура = &Номенклатура
		|	И ОстаткиОстатки.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Номенклатура", Параметры.ОстНоменклатура);
	Запрос.УстановитьПараметр("Дата", Параметры.ОстДата);
	Запрос.УстановитьПараметр("Склад", Параметры.ОстСклад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТО = ТаблицаОстатков.Добавить();
		СтрокаТО.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		СтрокаТО.Склад = ВыборкаДетальныеЗаписи.Склад;
		СтрокаТО.НомерПартии = ВыборкаДетальныеЗаписи.НомерПартии;
		СтрокаТО.Остаток = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		СтрокаТО.ДатаВыпускаПартии = ВыборкаДетальныеЗаписи.ДатаВыпуска;
	КонецЦикла;
	
	ТаблицаОстатков.Сортировать("ДатаВыпускаПартии Убыв");
	
КонецФункции

&НаКлиенте
Функция ТаблицаОстатковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Элемент.ТекущиеДанные.Номенклатура);
	СЗ.Добавить(Элемент.ТекущиеДанные.Склад);
	СЗ.Добавить(Элемент.ТекущиеДанные.НомерПартии);
	СЗ.Добавить(Элемент.ТекущиеДанные.Остаток);
	СЗ.Добавить(Элемент.ТекущиеДанные.ДатаВыпускаПартии);
	Закрыть(СЗ);
КонецФункции

#КонецОбласти

